#ifndef __ppvector_general__
#define __ppvector_general__

//==============================================================================
// general.h
// Вспомогательные обобщающие и дополнительные функции для работы с ПП векторами
//==============================================================================

// Обобщающая функция вывода элемента вектора в поток.
// Переопределяется для каждой специализации для вывода конкретного значения
void ppVector_element_print<ppVector* v>(FILE* f);

// Функция, осуществляющая вывод всех элементов вектора в цикле.
// Использует полиморфную функцию вывода отдельного элемента
void ppVector_print(FILE* f, ppVector* v);

#endif // __ppvector_general__
