#ifndef __container_atd__
#define __container_atd__

//------------------------------------------------------------------------------
// container.h - содержит класс,
// представляющий простейший контейнер
//------------------------------------------------------------------------------

#include "shape_atd.h"

//------------------------------------------------------------------------------

namespace simple_shapes {

//------------------------------------------------------------------------------
// Простейший контейнер на основе одномерного массива
//------------------------------------------------------------------------------

  class container
  {
    enum {max_len = 100}; // максимальная длина
    int len; // текущая длина
    shape *cont[max_len];
  public:
    void In(ifstream &ifst);     // ввод фигур в котнейнер из входного потока
    void Out(ofstream &ofst);    // вывод фигур в выходного потока
    void Clear();  // очистка контейнера от фигур
    container();    // инициализация контейнера
    ~container() {Clear();} // утилизация контейнера перед уничтожением
  };

//------------------------------------------------------------------------------

} // end simple_shapes namespace

#endif