#ifndef __container__
#define __container__

#include "ppvector.h"

//==============================================================================
// container.h - содержит тип данных,
// представляющий простейший контейнер
//==============================================================================
//------------------------------------------------------------------------------
// Ссылка на описание геометрической фигуры. Знание структуры самой фигуры
// для представленной реализации контейнера не требуется
struct Figure;

ppVector + <fig: Figure*;>;

#endif // __container__