//------------------------------------------------------------------------------
// container-in.cpp - содержит процедуру
// ввода фигур в контейнер
//------------------------------------------------------------------------------

#include "container.h"

//------------------------------------------------------------------------------
// Ввод содержимого контейнера
void Container::In(std::ifstream &ifst, FigureFactory* factory) {
  while(!ifst.eof())
  {
    if((cont[len] = Figure::In(ifst, factory)) != 0)
    {
      len++;
    }
  }
}
