//------------------------------------------------------------------------------
// coord-triangle-out.cpp - содержит процедуру
// вывода параметров треугольника
//------------------------------------------------------------------------------

#include "coord-triangle.h"

//------------------------------------------------------------------------------
// Вывод параметров треугольника
void CoordTriangle::Out(std::ofstream &ofst) {
  ofst << "It is Coord Triangle: a = ";
  a.Out(ofst);
  ofst << ", b = ";
  b.Out(ofst);
  ofst << ", c = ";
  c.Out(ofst);
  ofst << "\n";
}
