//------------------------------------------------------------------------------
// simple-triangle-in.cpp - содержит процедуру ввода параметров
// для уже созданного треугольника
//------------------------------------------------------------------------------

// #include <iostream>
#include "simple-triangle.h"

//------------------------------------------------------------------------------
// Ввод параметров треугольника
void SimpleTriangle::InData(std::ifstream &ifst) {
  ifst >> a >> b >> c;
  // std::cout << "    " << a << ", " << b <<  ", " << c << "\n";
}
