#ifndef __geometry__
#define __geometry__

//==============================================================================
// geometry.h - содержит описание структуры псевдоинтерфейса вычисления
// параметров геометрических фигур
//==============================================================================

//------------------------------------------------------------------------------
// структура, обобщающая геометрические функции
typedef struct Geometry {} <> Geometry;

//------------------------------------------------------------------------------
// Описание функций интерфейса

// Обобщающая функция для вычисления периметра через интерфейс geometry
double Perimeter<Geometry *x>();

// Обобщающая функция для вычисления площади через интерфейс geometry
double Area<Geometry *x>();

#endif // __geometry__