//==============================================================================
// inout.c - реализация обобщенных функций для работы
// через псевдоинтерфейс ввода-вывода
//==============================================================================

#include <stdio.h>
#include "inout.h"

//------------------------------------------------------------------------------
// Обобщающая функция для ввода через интерфейс InOut
void In<InOut *x>() { // =0;
  printf("Input for this type don't released\n");
} //= 0;

//------------------------------------------------------------------------------
// Обобщающая функция для вывода через интерфейс InOut
void Out<InOut *x>() {
  printf("Output for this type don't released\n");
} //= 0;
