#ifndef __coord_container__
#define __coord_container__

//==============================================================================
// coord-container.h - содержит тип данных,
// представляющий простейший контейнер
//==============================================================================
//------------------------------------------------------------------------------
// Ссылка на описание геометрической фигуры. Знание структуры самой фигуры
// для представленной реализации контейнера не требуется
struct CoordFigure;

enum {coord_max_len = 100}; // максимальная длина

//------------------------------------------------------------------------------
// Простейший контейнер на основе одномерного массива
typedef struct CoordContainer {
  int len; // текущая длина
  struct CoordFigure *cont[coord_max_len];
} CoordContainer;

#endif // __coord_container__