//==============================================================================
// coord-container-in.c - содержит процедуру
// ввода фигур в контейнер из потока
//==============================================================================

#include <stdio.h>
#include "coord-container.h"

//------------------------------------------------------------------------------
// Сигнатуры требуемых функций можно тоже подключить через
// заголовочный файл. Но, для простоты, можно и так описать.
struct CoordFigure *CoordFigureIn(FILE* ifdt);

//------------------------------------------------------------------------------
// Ввод содержимого контейнера из указанного потока
void CoordContainerIn(CoordContainer* c, FILE* ifst) {
  while(!feof(ifst))  {
    if((c->cont[c->len] = CoordFigureIn(ifst)) != 0) {
      c->len++;
    }
  }
}
