#ifndef __coord_figure__
#define __coord_figure__

//==============================================================================
// coord-figure.h - содержит описание обобщающей геометрической фигуры,
//==============================================================================

#include "coord-rectangle.h"
#include "coord-triangle.h"

//------------------------------------------------------------------------------
// значения ключей для каждой из фигур
typedef enum coord_key {COORD_RECTANGLE, COORD_TRIANGLE} coord_key;

//------------------------------------------------------------------------------
// структура, обобщающая все имеющиеся фигуры
typedef struct CoordFigure {
  coord_key k; // ключ
  // используемые альтернативы
  union { // используем простейшую реализацию
    CoordRectangle r;
    CoordTriangle t;
  };
} CoordFigure;

#endif // __coord_figure__