//==============================================================================
// simple-container-out.c - содержит процедуру
// вывода содержимого контейнера
//==============================================================================

#include <stdio.h>
#include "simple-container.h"

//------------------------------------------------------------------------------
// Сигнатуры требуемых функций можно тоже подключить через
// заголовочный файл. Но, для простоты, можно и так описать.
void SimpleFigureOut(struct SimpleFigure* s, FILE* ofst);

//------------------------------------------------------------------------------
// Вывод содержимого контейнера в указанный поток
void SimpleContainerOut(SimpleContainer *c, FILE* ofst) {
  fprintf(ofst, "Container contains %d elements.\n", c->len);
  for(int i = 0; i < c->len; i++) {
    fprintf(ofst, "%d: " , i);
    SimpleFigureOut(c->cont[i], ofst);
  }
}
