//==============================================================================
// simple-container-constr.c - содержит процедуры
// начальной инициализации и очистки (утилизации) контейнера
//==============================================================================

#include <stdlib.h>
#include "simple-container.h"
#include "simple-figure.h"

//------------------------------------------------------------------------------
// Инициализация контейнера
void SimpleContainerInit(SimpleContainer *c) {
  c->len = 0;
}

//------------------------------------------------------------------------------
// Очистка контейнера от элементов (освобождение памяти)
void SimpleContainerClear(SimpleContainer *c) {
  for(int i = 0; i < c->len; i++) {
    free(c->cont[i]);
  }
  SimpleContainerInit(c);
}
