#ifndef __simple_container__
#define __simple_container__

//==============================================================================
// simple-container.h - содержит тип данных,
// представляющий простейший контейнер
//==============================================================================
//------------------------------------------------------------------------------
// Ссылка на описание геометрической фигуры. Знание структуры самой фигуры
// для представленной реализации контейнера не требуется
struct SimpleFigure;

enum {simple_max_len = 100}; // максимальная длина

//------------------------------------------------------------------------------
// Простейший контейнер на основе одномерного массива
typedef struct SimpleContainer {
  int len; // текущая длина
  struct SimpleFigure *cont[simple_max_len];
} SimpleContainer;

#endif // __simple_container__