//------------------------------------------------------------------------------
// container_In.cpp - содержит процедуру
// ввода фигур в контейнер
//------------------------------------------------------------------------------

#include "container.h"

//------------------------------------------------------------------------------
// Ввод содержимого контейнера
void SimpleContainer::In(std::ifstream &ifst) {
  while(!ifst.eof())
  {
    if((cont[len] = SimpleFigure::In(ifst)) != 0)
    {
      len++;
    }
  }
}
