#ifndef __triangle_atd__
#define __triangle_atd__

//------------------------------------------------------------------------------
// triangle_atd.h - содержит описание класса треугольника,
// порожденного от базового класса shape
//------------------------------------------------------------------------------

// Требуется описание класса shape
#include "shape_atd.h"

//------------------------------------------------------------------------------

namespace simple_shapes {

//------------------------------------------------------------------------------

  // треугольник
  class triangle: public shape  
  {
    int a, b, c; // стороны
  public:
    // переопределяем интерфейс класса
    void InData(ifstream &ifst);  // ввод данных из потока
    void Out(ofstream &ofst);     // вывод данных в стандартный поток
    triangle() {} // создание без инициализации.
  };

//------------------------------------------------------------------------------

} // end simple_shapes namespace

#endif

