#ifndef __triangle__
#define __triangle__

//------------------------------------------------------------------------------
// triangle.h - содержит описание класса треугольника,
// порожденного от базового класса shape
//------------------------------------------------------------------------------

// Требуется описание класса Figure
#include "figure.h"
#include "point.h"

//------------------------------------------------------------------------------
// треугольник
class CoordTriangle: public CoordFigure
{
  Point a, b, c; // вершины треугольника
public:
  // переопределяем интерфейс класса
  void InData(std::ifstream &ifst);  // ввод данных из потока
  void Out(std::ofstream &ofst);     // вывод данных в стандартный поток
  CoordTriangle() {} // создание без инициализации.
};

#endif // __triangle__