#ifndef __simple_triangle_creator__
#define __simple_triangle_creator__

//------------------------------------------------------------------------------
// simple-triangle-creator.h - класс, определяющий фабричного метод
// для создания треугольника
//------------------------------------------------------------------------------

#include <fstream>
#include "figure-creator.h"

//------------------------------------------------------------------------------
// Фабрика, обеспечивающая создание треугольников при чтении признака фигуры
class SimpleTriangleCreator: public FigureCreator {
public:
  // Конструктор фабрики, устанавливющий признак треугольника (равен 2)
  SimpleTriangleCreator():FigureCreator(2) { }

  // Переопределение метода Create на создание треугольников.
  Figure* CreateFigure(int key);
};

//------------------------------------------------------------------------------

#endif // __simple_triangle_creator__