//==============================================================================
// objects.c - Реализация методов объектов
//==============================================================================

#include <stdio.h>
#include <stdlib.h>
#include "objects.h"

// Ввод параметров одной из фигур из файла
O* FigureCreateAndIn(FILE* ifst);

//==============================================================================
// Описание обработчиков специализаций прямоугольника
//==============================================================================

//------------------------------------------------------------------------------
// Обработчик ввода данных для прямоугольника
void Input<O.Rectangle* o>(FILE* f) {
  fscanf(f, "%d", &(o->@x));
  fscanf(f, "%d", &(o->@y));
}

//------------------------------------------------------------------------------
// Обработчик вывода данных прямоугольника
void Print<O.Rectangle* o>(FILE* f) {
  fprintf(f, "It is Rectangle: x = %d, y = %d\n", o->@x, o->@y);
}

//------------------------------------------------------------------------------
// Инициализация прямоугольника
void Init<O.Rectangle* o>() {
  o->@x = o->@y = 0;
}

//==============================================================================
// Описание обработчиков специализаций треугольника
//==============================================================================

//------------------------------------------------------------------------------
// Обработчик ввода данных для треугольника
void Input<O.Triangle* o>(FILE* f) {
  fscanf(f, "%d", &(o->@a));
  fscanf(f, "%d", &(o->@b));
  fscanf(f, "%d", &(o->@b));
}

//------------------------------------------------------------------------------
// Обработчик вывода данных треугольника
void Print<O.Triangle* o>(FILE* f) {
  fprintf(f, "It is Triangle: a = %d, b = %d, c = %d\n",
          o->@a, o->@b, o->@c);
}

//------------------------------------------------------------------------------
// Инициализация треугольника
void Init<O.Triangle* o>() {
  o->@a = o->@b = o->@c = 0;
}

//==============================================================================
// Описание обработчиков специализаций контейнера
//==============================================================================

//------------------------------------------------------------------------------
// Обработчик ввода данных для контейнера
void Input<O.Container* o>(FILE* f) {
  while(!feof(f))  {
    if((o->@cont[o->@len] = FigureCreateAndIn(f)) != 0) {
      o->@len++;
    }
  }
}

//------------------------------------------------------------------------------
// Обработчик вывода данных контейнера
void Print<O.Container* o>(FILE* f) {
  fprintf(f, "Container contains %d elements.\n", o->@len);
  for(int i = 0; i < o->@len; i++) {
    fprintf(f, "%d: " , i);
    Print<o->@cont[i]>(f);
  }
}

//------------------------------------------------------------------------------
// Инициализация контейнера
void Init<O.Container* o>() {
  o->@len = 0;
}

//------------------------------------------------------------------------------
// Очистка контейнера
void Сomplete<O.Container* o>() {
  for(int i = 0; i < o->@len; i++) {
    free(o->@cont[i]);
  }
  Init<(O*)o>();
}

