//==============================================================================
// parent.c - реализация обобщенных функций обобщенного родительского объекта,
// переопределяемых для конкретных объектов.
// Реализована как абстракная функция.
//==============================================================================

#include <stdlib.h>
#include "parent.h"


//------------------------------------------------------------------------------
// Информация о типе объекта
char* TypeInfo<O* o>() {
  return "Unknown";
}

//------------------------------------------------------------------------------
// Обобщенная функция ввода данных из входного потока
void Input<O* o>(FILE* f) {
  fprintf(f, "The object do not have Input message\n");
  exit(11);
}

//------------------------------------------------------------------------------
// Обобщенная функция вывода данных в выходной поток
void Print<O* o>(FILE* f) {
  fprintf(f, "The object do not have Print message\n");
  exit(12);
}

//------------------------------------------------------------------------------
// Инициализация разных объектов
void Init<O* o>() {}

//------------------------------------------------------------------------------
// Завершение разных объектов
void Сomplete<O* o>() {}

