//------------------------------------------------------------------------------
// container-out.cpp - содержит процедуру
// вывода содержимого контейнера
//------------------------------------------------------------------------------

#include "container.h"

//------------------------------------------------------------------------------
// Вывод содержимого контейнера
void Container::Out(std::ofstream &ofst) {
  ofst << "Container contents " << len << " elements.\n";
  for(int i = 0; i < len; i++) {
    ofst << i << ": ";
    cont[i]->Out(ofst);
  }
}
