//------------------------------------------------------------------------------
// rectangle_In.cpp - содержит процедуру ввода параметров 
// для уже созданного прямоугольника
//------------------------------------------------------------------------------

#include "rectangle_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Ввод параметров прямоугольника
  void rectangle::InData(ifstream &ifst) {
    ifst >> x >> y;
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
