#ifndef __shape_atd__
#define __shape_atd__

//------------------------------------------------------------------------------
// shape.h - содержит описание обобщающей геометрической фигуры,
// €вл€ющеес€ базовыым классом дл€ всех прочих фигур
//------------------------------------------------------------------------------

#include <fstream>
using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  //  ласс, обобщающает все имеющиес€ фигуры.
  // явл€етс€ абстрактным, обеспечива€, тем самым, проверку интерфейса 
  class shape {
  public:
	// иденитфикаци€, порождение и ввод фигуры из потока
	static  shape* In(ifstream &ifst);	   
    virtual void InData(ifstream &ifst) = 0;  // ввод данных из потока
    virtual void Out(ofstream &ofst) = 0;     // вывод данных в стандартный поток
//  protected:
//    shape() {};
  };

//------------------------------------------------------------------------------

} // end simple_shapes namespace

#endif