// Вариант задания:
//   хранение в элементе указателя на динамически создаваемый ключ
//   таблица на основе двоичного дерева

#include <stdio.h>
#include "tree.h"

int main(int argc, char* argv[]) {
  //----------------------------------------------------------------------------
  // Использование в качестве контейнера двоичного дерева
  //----------------------------------------------------------------------------

  // Формирование пустого дерева
  Tree tree = {NULL, NULL, NULL};

  return 0;
}
