//==============================================================================
// multimethod.c - содержит функции, опрделяющие реализацию мультиметода
// с использованием диспетчеризации. В отличие от прямой реализации
// используется цепочка одномерных индексных таблиц
//==============================================================================

#include <stdio.h>
#include "figure-rectangle.h"
#include "figure-triangle.h"

//------------------------------------------------------------------------------
// Обобщающая функция, задающая вход во вторую фигуру,
// Когда первая фигура уже определена и это прямоугольник
void MultimethodFirstRect<Figure* f2>(Figure.rect* r1, FILE* ofst) {} //= 0;

//------------------------------------------------------------------------------
// Обработчик специализации для двух прямоугольников
void MultimethodFirstRect<Figure.rect* r2>(Figure* r1, FILE* ofst) {
  fprintf(ofst, "Rectangle - Rectangle Combination\n");
}

//------------------------------------------------------------------------------
// Обработчик специализации для прямоугольника и треугольника
void MultimethodFirstRect<Figure.trian* t2>(Figure.rect* r1, FILE* ofst) {
  fprintf(ofst, "Rectangle - Triangle Combination\n");
}

//------------------------------------------------------------------------------
// Обобщающая функция, задающая вход во вторую фигуру,
// Когда первая фигура уже определена и это треугольник
void MultimethodFirstTrian<Figure* f2>(Figure.trian* t1, FILE* ofst) {} //= 0;

//------------------------------------------------------------------------------
// Обработчик специализации для треугольника и прямоугольника
void MultimethodFirstTrian<Figure.rect* r2>(Figure.trian* t1, FILE* ofst) {
  fprintf(ofst, "Triangle - Rectangle Combination\n");
}

//------------------------------------------------------------------------------
// Обработчик специализации для двух треугольников
void MultimethodFirstTrian<Figure.trian* t2>(Figure.trian* t1, FILE* ofst) {
  fprintf(ofst, "Triangle - Triangle Combination\n");
}

//------------------------------------------------------------------------------
// Обобщающая функция, задающая вход в первую фигуру.
// Вторая фигура передается как обычный параметр
void Multimethod<struct Figure* f1>(Figure* f2, FILE* ofst) {} //= 0;

//------------------------------------------------------------------------------
// Обработчик специализации, когда первая фигура - прямоугольник
void Multimethod<struct Figure.rect* r1>(Figure* f2, FILE* ofst) {
  MultimethodFirstRect<f2>(r1, ofst);
}

//------------------------------------------------------------------------------
// Обработчик специализации, когда первая фигура - треугольник
void Multimethod<struct Figure.trian* t1>(Figure* f2, FILE* ofst) {
  MultimethodFirstTrian<f2>(t1, ofst);
}


