#ifndef __figure_factory__
#define __figure_factory__

//------------------------------------------------------------------------------
// figure-factory.h - содержит описание абстрактной фабрики,
// являющееся базовыым классом для всех прочих фабрик
//------------------------------------------------------------------------------

#include <fstream>
#include "rectangle.h"
#include "triangle.h"

//------------------------------------------------------------------------------

// Класс, обобщающает все имеющиеся фигуры.
// Является абстрактным, обеспечивая, тем самым, проверку интерфейса
class FigureFactory {
public:
  // Методы порождения различный фигур
  virtual Rectangle* CreateRectangle() = 0;
  virtual Triangle* CreateTriangle() = 0;
};

//------------------------------------------------------------------------------

#endif // __figure_factory__