//------------------------------------------------------------------------------
// rectangle-container-constr.cpp - содержит конструктор
// и процедуру очистки контейнера
//------------------------------------------------------------------------------

#include "rectangle-container.h"

//------------------------------------------------------------------------------
// Инициализация контейнера
RectangleContainer::RectangleContainer(): len(0) { }

//------------------------------------------------------------------------------
// Очистка контейнера от элементов (освобождение памяти)
void RectangleContainer::Clear()
{
  for(int i = 0; i < len; i++)
  {
    delete cont[i];
  }
  len = 0;
}
