//==============================================================================
// rectangle_area.rs - содержит метод вывода прямоугольника
//==============================================================================
// pub mod rectangle;
pub use crate::rectangle_out::rectangle::Rectangle;

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника в форматируемый поток
pub fn area(r: &Rectangle) {
  println!("Rectangle Area = {}", r.x * r.y);
}

