//------------------------------------------------------------------------------
// rectangle-only-out.cpp - содержит процедуру
// вывода только параметров прямоугольника
//------------------------------------------------------------------------------

#include "rectangle.h"

//------------------------------------------------------------------------------
// Вывод только параметров прямоугольника
// void Figure::RectOnlyOut(std::ofstream &ofst) {}

//------------------------------------------------------------------------------
// Вывод только параметров прямоугольника
void Rectangle::RectOnlyOut(std::ofstream &ofst) {
    Out(ofst);
}
