//------------------------------------------------------------------------------
// coord-container-in.cpp - содержит процедуру
// ввода фигур в контейнер
//------------------------------------------------------------------------------

#include "coord-container.h"

//------------------------------------------------------------------------------
// Ввод содержимого контейнера
void CoordContainer::In(std::ifstream &ifst) {
  while(!ifst.eof())
  {
    if((cont[len] = CoordFigure::In(ifst)) != 0)
    {
      len++;
    }
  }
}
