//------------------------------------------------------------------------------
// coord-container-constr.cpp - содержит конструктор
// и процедуру очистки контейнера
//------------------------------------------------------------------------------

#include "coord-container.h"

//------------------------------------------------------------------------------
// Инициализация контейнера
CoordContainer::CoordContainer(): len(0) { }

//------------------------------------------------------------------------------
// Очистка контейнера от элементов (освобождение памяти)
void CoordContainer::Clear()
{
  for(int i = 0; i < len; i++)
  {
    delete cont[i];
  }
  len = 0;
}
