//------------------------------------------------------------------------------
// triangle_Out.cpp - содержит процедуру
// вывода параметров треугольника
//------------------------------------------------------------------------------

#include "triangle.h"

//------------------------------------------------------------------------------
// Вывод параметров треугольника
void SimpleTriangle::Out(std::ofstream &ofst) {
  ofst << "It is Simple Triangle: a = "
    << a << ", b = " << b
    << ", c = " << c << "\n";
}
