//==============================================================================
// triangle-peimeter.cpp - содержит метод для вычисления периметра треугольника
//==============================================================================

#include <stdio.h>
#include "triangle.h"

//------------------------------------------------------------------------------
// Вычисление периметра треугольника
// подключаемого через параметрическую таблицу
double Triangle::PerimeterTP(Any* f) {
  Triangle* t = reinterpret_cast<Triangle*>(f);
  return (double)(t->a + t->b + t->c);
}
