#ifndef __container_atd__
#define __container_atd__

//------------------------------------------------------------------------------
// container.h - содержит тип данных,
// представляющий простейший контейнер
//------------------------------------------------------------------------------

#include "shape_atd.h"

//------------------------------------------------------------------------------

namespace simple_shapes {

//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Простейший контейнер на основе одномерного массива
//------------------------------------------------------------------------------

  struct container
  {
    enum {max_len = 100}; // максимальная длина
    int len; // текущая длина
    shape *cont[max_len];
  };

//------------------------------------------------------------------------------

} // end simple_shapes namespace

#endif