//------------------------------------------------------------------------------
// main.cpp - содержит главную функцию, 
// обеспечивающую простое тестирование
//------------------------------------------------------------------------------

#include <iostream>
#include "container_atd.h"


//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

// Сигнатуры требуемых функций можно тоже подключить через
// заголовочный файл. Но, для простоты, можно и так описать.
void Init(container &c) ;
void In(container &c) ;
void Out(container &c) ;
void Clear(container &c);
double Area(container &c);

}

//------------------------------------------------------------------------------

using namespace simple_shapes;

//------------------------------------------------------------------------------

void main()
{
  container c;
  Init(c);
  In(c);
  Out(c);
  cout << "full: " << Area(c) << endl;
  Clear(c);
  cout << "empty: " << Area(c) << endl;
}