//------------------------------------------------------------------------------
// triangle_In.cpp - содержит процедуру ввода параметров 
// дл€ уже созданного треугольника
//------------------------------------------------------------------------------

#include <iostream>
#include "triangle_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // ¬вод параметров треугольника
  void In(triangle &t) 
  {
    cout << "Input Triangle: a, b, c = ";
    cin >> t.a >> t.b >> t.c;
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
