//==============================================================================
// figure-rectangle-in.c - Обработчик специализированного прямоугольника-фигуры.
//==============================================================================

#include <stdio.h>
#include "figure-rectangle.h"

//------------------------------------------------------------------------------
// Ввод прямоугольника-фигуры
void In<Figure.rect *f>() {
  // Запуск обработчика обобщенной фигуры
  InGeneralFigure((Figure*)f);
  RectangleIn(&(f->@));
}

//------------------------------------------------------------------------------
// Вывод прямоугольника-фигуры
void Out<Figure.rect *f>() {
  // Запуск обработчика обобщенной фигуры
  OutGeneralFigure((Figure*)f);
  RectangleOut(&(f->@));
}
