#ifndef __figure_triangle__
#define __figure_triangle__

//==============================================================================
// figure-triangle.h - Описание специализации треугольника-фигуры
//==============================================================================

#include "figure.h"
#include "triangle.h"

//------------------------------------------------------------------------------
// Прямая привязка треугольника
Figure + < trian: Triangle; >;

//------------------------------------------------------------------------------
// Подключение треугольника как Figure

// Ввод треугольника-фигуры
void In<Figure.trian *x>();

// Вывод треугольника-фигуры
void Out<Figure.trian *x>();

#endif // __figure_triangle__
