//==============================================================================
// main.c - содержит главную функцию,
// обеспечивающую простое тестирование
//==============================================================================

#include <stdio.h>

#include "figure-rectangle.h"
#include "figure-triangle.h"

//------------------------------------------------------------------------------
// Создание и ввод параметров одной из фигур
Figure* FigureCreate();

//------------------------------------------------------------------------------
int main() {
  struct Figure.rect iRect;
  iRect.@x = 10;
  iRect.@y = 20;
  Out<(Figure*)&iRect>();

  struct Figure *piFig;
  piFig = FigureCreate();
  Out<piFig>();

  return 0;
}
