//==============================================================================
// rectangle-inout.c - содержит функции ввода-вывода параметров
// для уже созданного прямоугольника
//==============================================================================

#include <stdio.h>
#include "rectangle.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника
void RectangleIn(Rectangle *r) {
  printf("x = ");
  scanf("%d", &(r->x));
  printf("y = ");
  scanf("%d", &(r->y));
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника
void RectangleOut(Rectangle *r) {
  printf("It is Rectangle: x = %d, y = %d\n", r->x, r->y);
}
