#ifndef __rectangle__
#define __rectangle__

//==============================================================================
// rectangle.h - содержит описание прямоугольника
//==============================================================================

//------------------------------------------------------------------------------
// прямоугольник
typedef struct Rectangle {
  int x, y; // ширина, высота
} Rectangle;

//------------------------------------------------------------------------------
// Прототипы функций, обеспечивающих обработку прямоугольника

// Ввод параметров прямоугольника
void RectangleIn(Rectangle *r);

// Вывод параметров прямоугольника
void RectangleOut(Rectangle *r);

// Вычисление периметра прямоугольника
double RectanglePerimeter(Rectangle *r);

// Вычисление площади прямоугольника
double RectangleArea(Rectangle *r);

#endif // __rectangle__