#ifndef __triangle__
#define __triangle__

//==============================================================================
// triangle.h - описание треугольника
//==============================================================================

//------------------------------------------------------------------------------
// треугольник
typedef struct Triangle {
  int a, b, c; // стороны треугольника
} Triangle;

//------------------------------------------------------------------------------
// Прототипы функций, обеспечивающих обработку треугольника

// Ввод параметров треугольника
void TriangleIn(Triangle *t);

// Вывод параметров треугольника
void TriangleOut(Triangle *t);

// Вычисление периметра треугольника
double TrianglePerimeter(Triangle *r);

// Вычисление площади треугольника
double TriangleArea(Triangle *r);

#endif // __triangle__

