//==============================================================================
// container-constr.c - содержит процедуры
// начальной инициализации и очистки (утилизации) контейнера
//==============================================================================

#include <stdlib.h>
#include "container.h"

//------------------------------------------------------------------------------
// Инициализация контейнера
void ContainerInit(Container *c) {
  ppVector_init((ppVector*)c);
}

//------------------------------------------------------------------------------
// Очистка контейнера от элементов (освобождение памяти)
void ContainerClear(Container *c) {
  for(int i = 0; i < ppVector_size((ppVector*)c); i++) {
    ppVector_index((ppVector*)c, i);
    free(c->@);
  }
  ContainerInit(c);
}
