//------------------------------------------------------------------------------
// coord-rectangle_In.cpp - содержит процедуру ввода параметров
// для уже созданного прямоугольника
//------------------------------------------------------------------------------

#include <iostream>
#include "coord-rectangle.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника
void CoordRectangle::InData(std::ifstream &ifst) {
  top_left.In(ifst);
  down_right.In(ifst);
}
