//==============================================================================
// figures-input.c - функция содания ввода всех альтернативных фигур.
// Реализована как централизованная. Единственная, требующая модификации
// при вводе данных. Но можно тоже сделать эволюционно расширяемой.
//==============================================================================

#include <stdio.h>
#include "objects.h"

//------------------------------------------------------------------------------
// Создание объекта-прямоугольника с инициализацией его целочисленных полей
O* CreateRectangle() {
  O* po = create_spec(O.Rectangle);
  Init<po>();
  return po;
}

//------------------------------------------------------------------------------
// Создание объекта-треугольника с инициализацией его целочисленных полей
O* CreateTriangle() {
  O* po = create_spec(O.Triangle);
  Init<po>();
  return po;
}

//------------------------------------------------------------------------------
// Ввод параметров одной из фигур из файла
O* FigureCreateAndIn(struct O.Fstream* ifst) {
  O* po;
  struct O.int k;
  fscanf(ifst->@f, "%d", &(k.@));
  switch(k.@) {
  case 1:
    // po = create_spec(O.Rectangle);
    po = CreateRectangle();
    break;
  case 2:
    // po = create_spec(O.Triangle);
    po = CreateTriangle();
    break;
  default:
    return 0;
  }
  // Init<po>();
  Input<po>(ifst);
  return po;
}
