//==============================================================================
// objects.c - Реализация методов объектов
//==============================================================================

#include <stdio.h>
#include <stdlib.h>
#include "objects.h"

// Ввод параметров одной из фигур из файла
O* FigureCreateAndIn(struct O.Fstream* f);

//==============================================================================
// Описание обработчиков специализаций прямоугольника
//==============================================================================

//------------------------------------------------------------------------------
// Информация о типе объекта
char* TypeInfo<O.Rectangle* o>() {
  return "Rectangle";
}

//------------------------------------------------------------------------------
// Обработчик ввода данных для прямоугольника
void Input<O.Rectangle* o>(struct O.Fstream* f) {
  Input<(O*)&(o->@x)>(f);
  Input<(O*)&(o->@y)>(f);
}

//------------------------------------------------------------------------------
// Обработчик вывода данных прямоугольника
void Print<O.Rectangle* o>(struct O.Fstream* f) {
  fprintf(f->@f, "It is Rectangle: x = ");  Print<(O*)&(o->@x)>(f);
  fprintf(f->@f, ", y =  ");                Print<(O*)&(o->@y)>(f);
  fprintf(f->@f, "\n");
}

//------------------------------------------------------------------------------
// Инициализация прямоугольника
void Init<O.Rectangle* o>() {
  init_spec(O.int, &o->@x);
  init_spec(O.int, &o->@y);
}

//==============================================================================
// Описание обработчиков специализаций треугольника
//==============================================================================

//------------------------------------------------------------------------------
// Информация о типе объекта
char* TypeInfo<O.Triangle* o>() {
  return "Triangle";
}

//------------------------------------------------------------------------------
// Обработчик ввода данных для треугольника
void Input<O.Triangle* o>(struct O.Fstream* f) {
  Input<(O*)&(o->@a)>(f);
  Input<(O*)&(o->@b)>(f);
  Input<(O*)&(o->@c)>(f);
}

//------------------------------------------------------------------------------
// Обработчик вывода данных треугольника
void Print<O.Triangle* o>(struct O.Fstream* f) {
  fprintf(f->@f, "It is Triangle: a = "); Print<(O*)&(o->@a)>(f);
  fprintf(f->@f, ", b =  ");              Print<(O*)&(o->@b)>(f);
  fprintf(f->@f, ", c =  ");              Print<(O*)&(o->@c)>(f);
  fprintf(f->@f, "\n");
}

//------------------------------------------------------------------------------
// Инициализация треугольника
void Init<O.Triangle* o>() {
  init_spec(O.int, &o->@a);
  init_spec(O.int, &o->@b);
  init_spec(O.int, &o->@c);
}

//==============================================================================
// Описание обработчиков специализаций контейнера
//==============================================================================

//------------------------------------------------------------------------------
// Информация о типе объекта
char* TypeInfo<O.Container* o>() {
  return "Container";
}

//------------------------------------------------------------------------------
// Обработчик ввода данных для контейнера
void Input<O.Container* o>(struct O.Fstream* f) {
  while(!feof(f->@f))  {
    if((o->@cont[o->@len] = FigureCreateAndIn(f)) != 0) {
      o->@len++;
    }
  }
}

//------------------------------------------------------------------------------
// Обработчик вывода данных контейнера
void Print<O.Container* o>(struct O.Fstream* f) {
  fprintf(f->@f, "Container contains %d elements.\n", o->@len);
  for(int i = 0; i < o->@len; i++) {
    fprintf(f->@f, "%d: " , i);
    Print<o->@cont[i]>(f);
  }
}

//------------------------------------------------------------------------------
// Инициализация контейнера
void Init<O.Container* o>() {
  o->@len = 0;
}

//------------------------------------------------------------------------------
// Очистка контейнера
void Сomplete<O.Container* o>() {
  for(int i = 0; i < o->@len; i++) {
    free(o->@cont[i]);
  }
  Init<(O*)o>();
}

//==============================================================================
// Описание обработчиков специализаций для целочисленного объекта
//==============================================================================

//------------------------------------------------------------------------------
// Информация о типе объекта
char* TypeInfo<O.int* o>() {
  return "int";
}

//------------------------------------------------------------------------------
// Обработчик ввода данных для целого числа
void Input<O.int* o>(struct O.Fstream* f) {
  fscanf(f->@f, "%d", &(o->@));
}

//------------------------------------------------------------------------------
// Обработчик вывода данных для целого числа
void Print<O.int* o>(struct O.Fstream* f) {
  fprintf(f->@f, "%d", o->@);
}

//------------------------------------------------------------------------------
// Инициализация  целого числа
void Init<O.int* o>() {
  // init_spec(O.int, o);
  o->@ = 0;
}

//==============================================================================
// Описание обработчиков специализаций для файлового потока
//==============================================================================

//------------------------------------------------------------------------------
// Информация о типе объекта
char* TypeInfo<O.Fstream* o>() {
  return "Fstream";
}

//------------------------------------------------------------------------------
// Файловый поток не является полиморфным объектом, который имеет общие функции,
// аналогичные другим объектам. Поэтому большинство из них пустые.
// Его собственные функции можно сделать полиморфными от объекта, но можно
// сделать их автономными, что возможно и для других объектов тоже, если у них
// функции уникальные и не используемые другими. Такие функции можно будет
// добавить в ходе дальнейшено расширения программы
//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Отрытие файла для чтения или записи
void FileOpen(struct O.Fstream* o, char* fileName, const char* opt) {
  o->@f = fopen(fileName, opt);
  if(o->@f == NULL) {
    printf("Incorrect file name = %s\n", fileName);
    exit(13);
  }
}

//------------------------------------------------------------------------------
// Закрытие файла, реализованного как объект
void FileClose(struct O.Fstream* o) {
  fclose(o->@f);
}