#ifndef __number__
#define __number__

//------------------------------------------------------------------------------
// Файл number.h - объявляет абстрактный класс, определяющий
// числовую величину и чистые методы работы с ней.
// Используется в качестве базового класса.
//------------------------------------------------------------------------------

typedef struct Number{}<> Number;

// Прототип обобщенной функции вывода чисел
void StdOut<Number* num>();

#endif // __number__
