//==============================================================================
// container.cpp - реализации методов контейнера, собранные воедино
//==============================================================================

#include "container.h"

//==============================================================================
// ћетоды супервизора, используемые дл€ обслуживани€ клиентов
//==============================================================================

//------------------------------------------------------------------------------
// »нициализаци€ контейнера
Container::Container(): len{0} { }

//------------------------------------------------------------------------------
// ќчистка контейнера от элементов (освобождение пам€ти)
void Container::Clear() {
  for(int i = 0; i < len; i++) {
    delete cont[i];
  }
  len = 0;
}

//------------------------------------------------------------------------------
// ¬вод содержимого контейнера
void Container::In(std::ifstream &ifst) {
  while(!ifst.eof()) {
    if((cont[len] = Figure::In(ifst)) != 0) {
      len++;
    }
  }
}

//==============================================================================
// ћетод выводв фигур, используемые клиентом, осуществл€ющим "рисование"
//==============================================================================

//------------------------------------------------------------------------------
// ¬ывод содержимого контейнера
void Container::Out(std::ofstream &ofst) {
  ofst << "Container contents " << len << " elements.\n";
  for(int i = 0; i < len; i++) {
    ofst << i << ": ";
    cont[i]->Out(ofst);
  }
}

//==============================================================================
// ћетоды, используемые клиентом, осуществл€ющим геометрические вычислени€
//==============================================================================

//------------------------------------------------------------------------------
// ¬ывод периметров в поток
void Container::PerimeterOut(std::ofstream &ofst) {
  ofst << "Perimeters of figures:\n";
  for(int i = 0; i < len; i++) {
    ofst << i << ": " << cont[i]->Perimeter() << "\n";
  }
}
//------------------------------------------------------------------------------
// ¬ывод площадей в поток
void Container::AreaOut(std::ofstream &ofst) {
  ofst << "Areas of figures:\n";
  for(int i = 0; i < len; i++) {
    ofst << i << ": " << cont[i]->Area() << "\n";
  }
}
