//==============================================================================
// rectangle.cpp - реализация методов прямоугольника
//==============================================================================

#include "rectangle.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника
void Rectangle::InData(std::ifstream &ifst) {
  ifst >> x >> y;
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника
void Rectangle::Out(std::ofstream &ofst) {
  ofst << "It is Rectangle: x = " << x << ", y = " << y << "\n";
}

//------------------------------------------------------------------------------
// Вычисление периметра прямоугольника
double Rectangle::Perimeter() {
  return (double)(2*(x + y));
}

//------------------------------------------------------------------------------
// Вычисление площади прямоугольника
double Rectangle::Area() {
  return (double)(x * y);
}
