//==============================================================================
// triangle.cpp - реализация методовтреугольника
//==============================================================================

#include <math.h>
#include "triangle.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника
void Triangle::InData(std::ifstream &ifst) {
  ifst >> a >> b >> c;
}

//------------------------------------------------------------------------------
// Вывод параметров треугольника
void Triangle::Out(std::ofstream &ofst) {
  ofst << "It is Triangle: a = "
    << a << ", b = " << b
    << ", c = " << c << "\n";
}

//------------------------------------------------------------------------------
// Вычисление периметра треугольника
double Triangle::Perimeter() {
  return (double)(a + b + c);
}

//------------------------------------------------------------------------------
// Вычисление площади треугольника
double Triangle::Area() {
  double p = double(a + b + c) / 2.0;
  return sqrt(p * (p-a) * (p-b) * (p-c));
}
