#ifndef __applique_collector__
#define __applique_collector__

//------------------------------------------------------------------------------
// applique-collector.h - содержит класс с методом формирования аппликации
// простого домика
//------------------------------------------------------------------------------

#include <fstream>
#include "builder.h"

//------------------------------------------------------------------------------
// Класс, формирующий аппликацию.
class AppliqueCollector {
public:
  static void Collect(std::ofstream &ofst, Builder* builder);
};

//------------------------------------------------------------------------------

#endif // __applique_collector__