//==============================================================================
// container-perimeter-out.c - содержит функцию, осуществляющую
// вычислени и тестовый вывод периметров для фигур в контейнере
//==============================================================================

#include <stdio.h>
#include "container.h"

//------------------------------------------------------------------------------
// Сигнатуры требуемых функций можно тоже подключить через
// заголовочный файл. Но, для простоты, можно и так описать.
double FigurePerimeter<Figure* f>();

//------------------------------------------------------------------------------
// Вывод содержимого контейнера в указанный поток
void ContainerPerimeterOut(struct ppVector.fig *c, FILE* ofst) {
  fprintf(ofst, "Perimeters of figures:\n");
  unsigned  len = ppVector_size((ppVector*)c);
  for(int i = 0; i < len; i++) {
    ppVector_index((ppVector*)c, i);
    fprintf(ofst, "%d: %f\n" , i, FigurePerimeter<c->@>());
  }
}
