#ifndef __container__
#define __container__

//==============================================================================
// container.h - содержит тип данных,
// представляющий простейший контейнер
//==============================================================================
//------------------------------------------------------------------------------
// Ссылка на описание геометрической фигуры. Знание структуры самой фигуры
// для представленной реализации контейнера не требуется
struct CoordFigure;

enum {max_len = 100}; // максимальная длина

//------------------------------------------------------------------------------
// Простейший контейнер на основе одномерного массива
typedef struct CoordContainer {
  int len; // текущая длина
  struct CoordFigure *cont[max_len];
} CoordContainer;

#endif // __container__