#ifndef __rectangle__
#define __rectangle__

//==============================================================================
// rectangle.h - содержит описание прямоугольника
//==============================================================================

#include "point.h"

//------------------------------------------------------------------------------
// прямоугольник
typedef struct CoordRectangle {
  Point top_left, down_right; // координаты верхнего и нижнего углов
} CoordRectangle;

#endif // __rectangle__