#ifndef __container__
#define __container__

//==============================================================================
// container.h - содержит тип данных,
// представляющий простейший контейнер
//==============================================================================
//------------------------------------------------------------------------------

// Для формирования монолитного массива в контейнере используется
// специализированный прямоугольник (кривое решение для демонстрации init_spec)
#include "figure-rectangle.h"

enum {max_len = 100}; // максимальная длина

//------------------------------------------------------------------------------
// Простейший контейнер на основе одномерного массива
typedef struct Container {
  int len; // текущая длина
  struct Figure.rect cont[max_len];
} Container;

#endif // __container__