//==============================================================================
// container-in.c - содержит процедуру
// ввода фигур в контейнер из потока
//==============================================================================

#include <stdio.h>
#include "container.h"

//------------------------------------------------------------------------------
// Сигнатуры требуемых функций можно тоже подключить через
// заголовочный файл. Но, для простоты, можно и так описать.
void FigureCreateAndIn(struct Figure* f, FILE* ifst);

//------------------------------------------------------------------------------
// Ввод содержимого контейнера из указанного потока
void ContainerIn(Container* c, FILE* ifst) {
  while(!feof(ifst))  {
    FigureCreateAndIn((Figure*)&(c->cont[c->len]), ifst);
    c->len++;
  }
}
