//==============================================================================
// figure.c - функции, задающие работу с обобщенными фигурами
// и их специализациями
//==============================================================================

#include "figure.h"

//------------------------------------------------------------------------------
// Прототипы функций вывода основ специализаций
void RectangleIn(Rectangle *r, FILE* ifst);
void RectangleOut(Rectangle *r, FILE* ofst);
void TriangleIn(Triangle *t, FILE* ifst);
void TriangleOut(Triangle *t,FILE* ofst);

//------------------------------------------------------------------------------
// Обобщающая функция для ввода параметров фигуры
void FigureIn<Figure *f>(FILE* file) {} //= 0;

//------------------------------------------------------------------------------
// Ввод прямоугольника как фигуры
void FigureIn<Figure.Rectangle *f>(FILE* ifst) {
  RectangleIn(&(f->@), ifst);
}

//------------------------------------------------------------------------------
// Ввод треугольника как фигуры
void FigureIn<Figure.Triangle *f>(FILE* ifst) {
  TriangleIn(&(f->@), ifst);
}

//------------------------------------------------------------------------------
// Обобщенная функция вывода любой фигуры
void FigureOut<Figure *f>(FILE* ofst) {} //= 0;

//------------------------------------------------------------------------------
// Обработчик, осуществляющий вывод фигуры из семейства прямоугольников
void FigureOut<Figure.Rectangle *f>(FILE* ofst) {
  RectangleOut(&(f->@), ofst);
}

//------------------------------------------------------------------------------
// Обработчик, осуществляющий вывод фигуры из семейства треугольников
void FigureOut<Figure.Triangle *f>(FILE* ofst) {
  TriangleOut(&(f->@), ofst);
}
