//==============================================================================
// rectangle.c - содержит функции обработки простого прямоугольника
//==============================================================================

#include <stdio.h>
#include "rectangle.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника из файла
void RectangleIn(Rectangle *r, FILE* ifst) {
  fscanf(ifst, "%lf", &(r->x));
  fscanf(ifst, "%lf", &(r->y));
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника в форматируемый поток
void RectangleOut(Rectangle *r, FILE* ofst) {
  fprintf(ofst, "It is Rectangle: x = %.3lf, y = %.3lf\n",
          r->x, r->y);
}
