//==============================================================================
// triangle.c - содержит функции обработки простого треугольника
//==============================================================================

#include <stdio.h>
#include "triangle.h"

//------------------------------------------------------------------------------
// Ввод параметров треугольника из потока
void TriangleIn(Triangle *t, FILE* ifst) {
  // fscanf(ifst, "%d%d%d", &(t->a), &(t->b), &(t->c));
  fscanf(ifst, "%lf", &(t->a));
  fscanf(ifst, "%lf", &(t->b));
  fscanf(ifst, "%lf", &(t->c));
}

//------------------------------------------------------------------------------
// Вывод параметров треугольника в поток
void TriangleOut(Triangle *t, FILE *ofst) {
  fprintf(ofst, "It is Triangle: a = %.3lf, b = %.3lf, c = %.3lf\n",
          t->a, t->b, t->c);
}
