#ifndef __figure_proxy__
#define __figure_proxy__

//==============================================================================
// figure-proxy.h - Прокси для любой фигуры.
// Можно сделать прокси, ориентированный на конкретну фигуру, но не сейчас...
//==============================================================================

#include "figure.h"

#define FILE_NAME_MAX_LEN 32 // Максимальная длина имени файла

typedef struct Proxy {
    char fileName[FILE_NAME_MAX_LEN]; // Имя файла подключаемой фигуры
    Figure* f; // указатель на подключаемую фигуру
} Proxy;

//------------------------------------------------------------------------------
// Фигура - декоратор
Figure + < proxy: Proxy; > ;

#endif // __figure_proxy__
