//==============================================================================
// figure-in.c - реализация обобщенной функции ввода фигуры,
// переопределяемой различными обработчиками специализации.
// Реализована как абстракная функция.
//==============================================================================

#include <stdio.h>
#include "figure.h"

//------------------------------------------------------------------------------
// Обобщающая функция для ввода параметров фигуры
void FigureIn<Figure *f>(FILE* file) {} //= 0;

//------------------------------------------------------------------------------
// Обобщающая функция для фигуры из прокси
// Ничего не делает, если идет обращени не к прокси
void ProxyFigureIn<Figure *f>() {} //= 0;
