#ifndef __figure_rectangle__
#define __figure_rectangle__

//==============================================================================
// figure-rectangle.h - описание специализации фигуры как прямоугольника
//==============================================================================

#include "figure.h"
#include "rectangle.h"

//------------------------------------------------------------------------------
// Фигура - прямоугольник
Figure + < rect: Rectangle; >;

//------------------------------------------------------------------------------
// Ввод прямоугольника из файла
Input + <rect: void;>;

#endif // __figure_rectangle__
