#ifndef __figure__
#define __figure__

//==============================================================================
// figure.h - содержит описание обобщающей геометрической фигуры,
//==============================================================================

// #include "rectangle.h"
// #include "triangle.h"

//------------------------------------------------------------------------------
// структура, обобщающая фигуры
typedef struct Figure {} <> Figure;

//------------------------------------------------------------------------------
// Расширяемый перечислимый тип, используемый для эволюционного расширения
// ввода данных из файлов
typedef struct Input {} <> Input;

#endif // __figure__