#ifndef __circle_factory__
#define __circle_factory__

//------------------------------------------------------------------------------
// circle-factory.h - содержит описание фабрики, создаюющей круги
//------------------------------------------------------------------------------

#include  "circle.h"
#include "figure-factory.h"

//------------------------------------------------------------------------------
// Класс фабрики, порождающей круги
class CircleFactory: public FigureFactory {
  int key; // Ключ фабрики, совпадающий с ключом в файле
public:
  // иденитификация, порождение и ввод фигуры из потока
  virtual Figure* Test(int k);
  // Конструктор, регистрирующий ключ = 1 для кругов
  CircleFactory();
};

#endif // __circle_factory__