/------------------------------------------------------------------------------
// rectangle_Area.cpp - содержит процедуру класса,
// вычисляющую площадь прямоугольника
//------------------------------------------------------------------------------

#include "rectangle_atd.h"

//------------------------------------------------------------------------------

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Вычисление площади прямоугольника
  double rectangle::Area() {
    return x * y;
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
