//==============================================================================
// triangle-area.c - содержит функцию
// вычисления площади треугольника
//==============================================================================

#include <stdio.h>
#include <math.h>
#include "triangle.h"

//------------------------------------------------------------------------------
// Вычисление площади треугольника
double TriangleArea(Triangle *t) {
  double p = (double)(t->a + t->b + t->c) / 2.0;
  return sqrt(p * (p - t->a) * (p - t->b) * (p - t->c) );
}
