//------------------------------------------------------------------------------
// circle_Out.cpp - содержит процедуру
// вывода параметров круга
//------------------------------------------------------------------------------

#include "circle_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Вывод параметров круга
  void circle::Out(ofstream &ofst) {
    ofst << "It is Circle: r = " << r << endl;
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
