#ifndef __curcle_atd__
#define __curcle_atd__

//------------------------------------------------------------------------------
// rectangle_atd.h - содержит описание класса прямоугольника,
// порожденного от базового класса shape
//------------------------------------------------------------------------------

// Требуется описание класса shape
#include "shape_atd.h"

//------------------------------------------------------------------------------

namespace simple_shapes {

//------------------------------------------------------------------------------

  // прямоугольник
  class circle: public shape
  {
    int r; // радиус
  public:
    // переопределяем интерфейс класса
    void InData(ifstream &ifst);  // ввод данных из потока
    void Out(ofstream &ofst);    // вывод данных в стандартный поток
    circle() {} // создание без инициализации.
  };

//------------------------------------------------------------------------------

} // end simple_shapes namespace

#endif  // __curcle_atd__