//------------------------------------------------------------------------------
// container_Constr.cpp - содержит конструктор 
// и процедуру очистки контейнера
//------------------------------------------------------------------------------

#include "container_atd.h"

//------------------------------------------------------------------------------

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Инициализация контейнера
  container::container(): len(0) { }

//------------------------------------------------------------------------------

  // Очистка контейнера от элементов (освобождение памяти)
  void container::Clear()
  {
    for(int i = 0; i < len; i++)
    {
      delete cont[i];
    }
    len = 0;
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
