#ifndef __figure_color__
#define __figure_color__

//==============================================================================
// figure-color.h - описание специализации фигуры как цвет + основа
//==============================================================================

#include "figure.h"
#include "rectangle.h"
#include "triangle.h"

typedef struct Color {
    unsigned int color; // цвет фигуры
} <> Color; // Жесткая специализация декоратора как фигуры

//------------------------------------------------------------------------------
// Фигура - декоратор как специализация фигуры
Figure + < color: Color; > ;

//------------------------------------------------------------------------------
// Формирование прямых специализаций декоратора
Color + <rect: Rectangle;>;
Color + <trian: Triangle;>;

//------------------------------------------------------------------------------
// Ввод цветного прямоугольника из файла
Input + <color_rect: void;>;
// Ввод цветного треугольника из файла
Input + <color_trian: void;>;


#endif // __figure_color__
