#ifndef __inout__
#define __inout__

//==============================================================================
// inout.h - содержит описание структуры псевдоинтерфейса ввода-вывода
//==============================================================================

//------------------------------------------------------------------------------
// структура, обобщающая функции ввода вывода
typedef struct InOut {} <> InOut;

//------------------------------------------------------------------------------
// Описание функций интерфейса

// Обобщающая функция для ввода через интерфейс InOut
void In<InOut *x>();

// Обобщающая функция для вывода через интерфейс InOut
void Out<InOut *x>();

#endif // __inout__