//------------------------------------------------------------------------------
// circle_In.cpp - содержит процедуру ввода параметров
// для уже созданного круга
//------------------------------------------------------------------------------

#include "circle_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Ввод параметров круга
  void circle::InData(ifstream &ifst) {
    ifst >> r;
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
