//==============================================================================
// rectangle-perimeter.c - содержит функцию
// вывода параметров прямоугольника
//==============================================================================

#include <stdio.h>
#include "circle.h"

const double PI = 3.1415926535;

//------------------------------------------------------------------------------
// Вычисление периметра прямоугольника
double CirclePerimeter(Circle *c) {
  return (double)(2.0 * PI * c->r);
}
