//------------------------------------------------------------------------------
// container-in.cpp - содержит процедуру
// ввода фигур в контейнер
//------------------------------------------------------------------------------

#include "container.h"
#include "figure-factory.h"

//------------------------------------------------------------------------------
// Ввод содержимого контейнера
void Container::In(std::ifstream &ifst) {
  while(!ifst.eof()) {
    if((cont[len] = FigureFactory::Create(ifst)) != nullptr) {
      len++;
    }
  }
}
