//------------------------------------------------------------------------------
// container-out.cpp - содержит процедуру
// вывода содержимого контейнера
//------------------------------------------------------------------------------

#include "container.h"

//------------------------------------------------------------------------------
// Вывод содержимого контейнера в файл
void Container::Out(std::ofstream &ofst) {
  ofst << "Container contains " << len << " elements.\n";
  for(int i = 0; i < len; i++) {
    ofst << i << ": ";
    cont[i]->Out(ofst);
  }
}

//------------------------------------------------------------------------------
// Вывод содержимого контейнера в cout
void Container::Out() {
  std::cout << "Container contains " << len << " elements.\n";
  for(int i = 0; i < len; i++) {
    std::cout << i << ": ";
    cont[i]->Out();
  }
}
