//------------------------------------------------------------------------------
// rectangle-out.cpp - содержит процедуру
// вывода параметров прямоугольника
//------------------------------------------------------------------------------

#include "rectangle.h"

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника в файл
void Rectangle::Out(std::ofstream &ofst) {
  ofst << "It is Rectangle: x = " << x << ", y = " << y << "\n";
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника в cout
void Rectangle::Out() {
  std::cout << "It is Rectangle: x = " << x << ", y = " << y << "\n";
}
