//------------------------------------------------------------------------------
// triangle-out.cpp - содержит процедуру
// вывода параметров треугольника
//------------------------------------------------------------------------------

#include "triangle.h"

//------------------------------------------------------------------------------
// Вывод параметров треугольника в файл
void Triangle::Out(std::ofstream &ofst) {
  ofst << "It is Triangle: a = "
    << a << ", b = " << b
    << ", c = " << c << "\n";
}

//------------------------------------------------------------------------------
// Вывод параметров треугольника в cout
void Triangle::Out() {
  std::cout << "It is Triangle: a = "
  << a << ", b = " << b
  << ", c = " << c << "\n";
}
