//------------------------------------------------------------------------------
// figure.cpp - содержит реализации всех внутренних методов фигуры
// и инициализацию используемых статических переменных
//------------------------------------------------------------------------------

// #include <iostream>
#include "figure.h"

//------------------------------------------------------------------------------
// Счетчик числа зарегистрированных специализаций
int Figure::specCounter = 0;

//------------------------------------------------------------------------------
// Параметрическая таблица для функций ввода
std::vector<InDataP> InP;
// Параметрическая таблица для функций вывода
std::vector<OutDataP> OutP;
// Параметрическая таблица для функций вычисления периметра
std::vector<PerimeterDataP> PerimeterP;

//------------------------------------------------------------------------------
// Метод ввода фигуры через параметрическую таблицу
void Figure::InFP(std::ifstream &ifst) {
  InP[specTag](this, ifst);
}

//------------------------------------------------------------------------------
// Метод вывода фигуры через параметрическую таблицу
void Figure::OutFP(std::ofstream &ofst) {
  OutP[specTag](this, ofst);
}

//------------------------------------------------------------------------------
// Вычисление периметра фигуры через параметрическую таблицу
double Figure::PerimeterFP() {
  // std::cout << "Perimeter of figure...\n";
  return PerimeterP[specTag](this);
}
