//------------------------------------------------------------------------------
// decorator-out.cpp - содержит метод
// вывода параметров декоратора
//------------------------------------------------------------------------------

#include "decorator.h"

//------------------------------------------------------------------------------
// Вывод параметров декорируемой фигуры
void Decorator::Out(std::ofstream &ofst) {
  if(fig != nullptr) {
    fig->Out(ofst);
  }
  ofst << "    Color is 0x" << std::hex << std::uppercase << color << "\n";
}
