//------------------------------------------------------------------------------
// rectangle-out.cpp - содержит процедуру
// вывода параметров прямоугольника
//------------------------------------------------------------------------------

#include "rectangle.h"

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника
void Rectangle::Out(std::ofstream &ofst) {
  ofst << "It is Rectangle: x = " << x << ", y = " << y << "\n";
}
