#ifndef __rectangle_atd__
#define __rectangle_atd__

//------------------------------------------------------------------------------
// rectangle_atd.h - содержит описание класса прямоугольника,
// порожденного от базового класса shape
//------------------------------------------------------------------------------

// Требуется описание класса shape
#include "shape_atd.h"

//------------------------------------------------------------------------------

namespace simple_shapes {

//------------------------------------------------------------------------------

  // прямоугольник
  class rectangle: public shape 
  {
    int x, y; // ширина, высота
  public:
    // переопределяем интерфейс класса
    void InData(ifstream &ifst);  // ввод данных из потока
    void Out(ofstream &ofst);    // вывод данных в стандартный поток
    rectangle() {} // создание без инициализации.
  };

//------------------------------------------------------------------------------

} // end simple_shapes namespace

#endif