#ifndef __figure__
#define __figure__

//==============================================================================
// figure.h - содержит описание обобщающей геометрической фигуры,
//==============================================================================

// #include "rectangle.h"
// #include "triangle.h"

//------------------------------------------------------------------------------
// структура, обобщающая фигуры
typedef struct Figure {} <> Figure;

//------------------------------------------------------------------------------
// структура, обобщающая перечисления фигур
typedef struct EnumFig {} <> EnumFig;

#endif // __figure__