//==============================================================================
// figure-triangle-in.c - Обработчик специализации, осуществляющий
// ввод треугольника как фигуры.
// Подставляется вместо абстрактной обобщающей функции
//==============================================================================

#include <stdio.h>
#include "figure-triangle.h"

//------------------------------------------------------------------------------
// Прототип функции ввода треугольника
void TriangleIn(Triangle *t, FILE* ifst);
// Прототип обобщеннай функции ввода фигуры
void FigureIn<Figure *f>(FILE* file);
// Прототип обобщенной функции создания фигуры клонированием
Figure* FigureCreateUseTag<Figure *pFig>(int k);

//------------------------------------------------------------------------------
// Ввод треугольника как фигуры
void FigureIn<Figure.trian *f>(FILE* ifst) {
  TriangleIn(&(f->@), ifst);
}

//------------------------------------------------------------------------------
// Создание треугольника как фигуры клонированием
Figure* FigureCreateUseTag<EnumFig.trian *pEnumFig>(int k) {
  if(k == 2) {
    // printf("k = %d: It is Triangle\n", k);
    return create_spec(Figure.trian);
  } else {
    return NULL;
  }
}
