//------------------------------------------------------------------------------
// container_Area.cpp - содержит процедуру класса
// вычислени€ суммарной площади всех фигур, расположенных в контейнере
//------------------------------------------------------------------------------

#include "container_atd.h"

//------------------------------------------------------------------------------

namespace simple_shapes {

//------------------------------------------------------------------------------

  // ¬ычисление суммарной площади дл€ фигур, размещенных в контейнере
  double container::Area() 
  {
    double a = 0;
    for(int i = 0; i < len; i++) {
      a += cont[i]->Area();
    }
    return a;
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
