//------------------------------------------------------------------------------
// container_In.cpp - содержит процедуру 
// ввода фигур в контейнер
//------------------------------------------------------------------------------

#include <iostream>
#include "container_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Сигнатуры требуемых функций можно тоже подключить через
  // заголовочный файл. Но, для простоты, можно и так описать.
  // Эта обычная функция позволяет сфоромирвать геометрическую
  // фигуру нужного класса
  shape *In();

//------------------------------------------------------------------------------

  // Ввод содержимого контейнера
  void container::In() {
    cout 
      << "Do you want to input next shape (yes=\'y\', no=other character)? " 
      << endl;
    char k;
    cin >> k;
    while(k == 'y')
    {
      cout << len << ": ";
      if((cont[len] = simple_shapes::In()) != 0)
      {
        len++;
      }

      cout 
        << "Do you want to input next shape (yes=\'y\', no=other character)? " 
        << endl;
      cin >> k;
    }
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
