//------------------------------------------------------------------------------
// container_Out.cpp - содержит процедуру 
// вывода содержимого контейнера
//------------------------------------------------------------------------------

#include <iostream>
#include "container_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // ¬ывод содержимого контейнера
  void container::Out() {
    cout << "Container contents " << len << " elements." << endl;
    for(int i = 0; i < len; i++) {
      cout << i << ": ";
      cont[i]->Out();
    }
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
