//------------------------------------------------------------------------------
// main.cpp - содержит главную функцию, 
// обеспечивающую простое тестирование
//------------------------------------------------------------------------------

#include <iostream>
#include "container_atd.h"


//------------------------------------------------------------------------------

using namespace std;

//------------------------------------------------------------------------------

using namespace simple_shapes;

//------------------------------------------------------------------------------

void main()
{
  container c;
  c.In();
  c.Out();
  cout << "full: " << c.Area() << endl;
  c.Clear();
  cout << "empty: " << c.Area() << endl;
}