//------------------------------------------------------------------------------
// rectangle_In.cpp - содержит процедуру ввода параметров 
// для уже созданного прямоугольника
//------------------------------------------------------------------------------

#include <iostream>
#include "rectangle_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Вывод параметров прямоугольника
  void rectangle::In() {
    cout << "Input Rectangle: x, y = ";
    cin >> x >> y;
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
