#ifndef __rectangle_atd__
#define __rectangle_atd__

//------------------------------------------------------------------------------
// rectangle_atd.h - содержит описание класса прямоугольника,
// порожденного от базового класса shape
//------------------------------------------------------------------------------

// Требется описание класса shape
#include "shape_atd.h"

//------------------------------------------------------------------------------

namespace simple_shapes {

//------------------------------------------------------------------------------

  // прямоугольник
  class rectangle: public shape 
  {
    int x, y; // ширина, высота
  public:
    // переопределяем интерфейс класса
    void In();     // ввод данных из стандартного потока
    void Out();    // вывод данных в стандартный поток
    double Area(); // вычисление площади фигуры
    rectangle(int _x, int _y); // создание с инициализацией.
    rectangle() {} // создание без инициализации.
  };

//------------------------------------------------------------------------------

} // end simple_shapes namespace

#endif