//------------------------------------------------------------------------------
// rectangle_Constr.cpp - содержит конструктор
// инициализации прямоугольника
//------------------------------------------------------------------------------

#include "rectangle_atd.h"

//------------------------------------------------------------------------------

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Динамическое создание прямоугольника по двум сторонам
  rectangle::rectangle(int _x, int _y): x(_x), y(_y) {}

//------------------------------------------------------------------------------

} // end simple_shapes namespace
