#ifndef __triangle_atd__
#define __triangle_atd__

//------------------------------------------------------------------------------
// triangle_atd.h - содержит описание класса треугольника,
// порожденного от базового класса shape
//------------------------------------------------------------------------------

// Требется описание класса shape
#include "shape_atd.h"

//------------------------------------------------------------------------------

namespace simple_shapes {

//------------------------------------------------------------------------------

  // треугольник
  class triangle: public shape  
  {
    int a, b, c; // стороны
  public:
    // переопределяем интерфейс класса
    void In();     // ввод данных из стандартного потока
    void Out();    // вывод данных в стандартный поток
    double Area(); // вычисление площади фигуры
    triangle(int _a, int _b, int _c); // создание с инициализацией
    triangle() {} // создание без инициализации.
  };

//------------------------------------------------------------------------------

} // end simple_shapes namespace

#endif

