//------------------------------------------------------------------------------
// triangle_Out.cpp - содержит процедуру 
// вывода параметров треугольника
//------------------------------------------------------------------------------

#include <iostream>
#include "triangle_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Вывод параметров треугольника
  void triangle::Out() {
    cout << "It is Triangle: a = " 
      << a << ", b = " << b
      << ", c = " << c << endl;
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
