//------------------------------------------------------------------------------
// triangle_Constr.cpp - содержит конструктор,
// инициализирующий треугольник
//------------------------------------------------------------------------------

#include "triangle_atd.h"

//------------------------------------------------------------------------------

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Инициализация уже созданного треугольника по трем сторонам
  triangle::triangle(int _a, int _b, int _c): a(_a), b(_b), c(_c) {}

//------------------------------------------------------------------------------

} // end simple_shapes namespace
