//------------------------------------------------------------------------------
// triangle_Area.cpp - содержит процедуру 
// вычисления площади треугольника по трем сторонам
//------------------------------------------------------------------------------

#include <math.h>
#include "triangle_atd.h"

//------------------------------------------------------------------------------

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Вычисление площади треугольника
  double triangle::Area() {
    double p = (a + b + c) / 2.0; // полупериметр
    return sqrt(p * (p-a) * (p-b) * (p-c));
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
