//------------------------------------------------------------------------------
// triangle_In.cpp - содержит процедуру ввода параметров 
// дл€ уже созданного треугольника
//------------------------------------------------------------------------------

#include <iostream>
#include "triangle_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // ¬вод параметров треугольника
  void triangle::In() {
    cout << "Input Triangle: a, b, c = ";
    cin >> a >> b >> c;
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
