//==============================================================================
// container-perimeter-out.c - содержит функцию, осуществляющую
// вычислени и тестовый вывод периметров для фигур в контейнере
//==============================================================================

#include <stdio.h>
#include "container.h"

//------------------------------------------------------------------------------
// Сигнатуры требуемых функций можно тоже подключить через
// заголовочный файл. Но, для простоты, можно и так описать.
double FigurePerimeter(struct Figure* s);

//------------------------------------------------------------------------------
// Вывод содержимого контейнера в указанный поток
void ContainerPerimeterOut(Container *c, FILE* ofst) {
  fprintf(ofst, "Perimeters of figures:\n");
  for(int i = 0; i < c->len; i++) {
    fprintf(ofst, "%d: %lf\n" , i, FigurePerimeter(c->cont[i]));
  }
}

//------------------------------------------------------------------------------
// Сумма всех периметров в контейнере
double  ContainerPerimeter(Container* c) {
  double p = 0.0;
  for(int i = 0; i < c->len; i++) {
    p += FigurePerimeter(c->cont[i]);
  }
  return p;
}
