#ifndef __container__
#define __container__

//------------------------------------------------------------------------------
// container.h - содержит тип данных,
// представляющий простейший контейнер
//------------------------------------------------------------------------------

#include "figure.h"

//------------------------------------------------------------------------------

namespace figures {

//------------------------------------------------------------------------------

//------------------------------------------------------------------------------
// Простейший контейнер на основе одномерного массива
//------------------------------------------------------------------------------

  struct container
  {
    enum {max_len = 100}; // максимальная длина
    int len; // текущая длина
    shape *cont[max_len];
  };

//------------------------------------------------------------------------------

} // end simple_shapes namespace

#endif
