//------------------------------------------------------------------------------
// container.cpp - содержит процедуры для работы с контейнером
//------------------------------------------------------------------------------

#include <iostream>
#include "container.h"

//------------------------------------------------------------------------------

using namespace std;

namespace figures {

//------------------------------------------------------------------------------

  // Сигнатуры требуемых функций можно тоже подключить через
  // заголовочный файл. Но, для простоты, можно и так описать.
  shape *In();
  void Out(shape &s);


//------------------------------------------------------------------------------

  // Ввод содержимого контейнера
  void In(container &c) {
    cout 
      << "Do you want to input next shape (yes=\'y\', no=other character)? " 
      << endl;
    char k;
    cin >> k;
    while(k == 'y')
    {
      cout << c.len << ": ";
      if((c.cont[c.len] = In()) != 0)
      {
        c.len++;
      }

      cout 
        << "Do you want to input next shape (yes=\'y\', no=other character)? " 
        << endl;
      cin >> k;
    }
  }

//------------------------------------------------------------------------------

  // Вывод содержимого контейнера
  void Out(container &c) {
    cout << "Container contents " << c.len << " elements." << endl;
    for(int i = 0; i < c.len; i++) {
      cout << i << ": ";
      Out(*(c.cont[i]));
    }
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
