#ifndef __figure__
#define __figure__

//------------------------------------------------------------------------------
// figure.h - содержит описание обобщающей геометрической фигуры,
//------------------------------------------------------------------------------

#include "rectangle.h"
#include "triangle.h"

//------------------------------------------------------------------------------

namespace figures {

  // структура, обобщающая все имеющиеся фигуры
  struct figure {
    // значения ключей для каждой из фигур
    enum key {RECTANGLE, TRIANGLE};
    key k; // ключ
    // используемые альтернативы
    union { // используем простейшую реализацию
      rectangle r;
      triangle t;
    };
  };

//------------------------------------------------------------------------------

} // end simple_shapes namespace

#endif // figure
