#ifndef __rectangle__
#define __rectangle__

//------------------------------------------------------------------------------
// rectangle.h - содержит описание прямоугольника
//------------------------------------------------------------------------------

namespace figures {

//------------------------------------------------------------------------------

  // прямоугольник
  struct rectangle {
    int x, y; // ширина, высота
  };

//------------------------------------------------------------------------------

} // end figures namespace

#endif
