#ifndef __container__
#define __container__

//==============================================================================
// container.h - содержит тип данных, представляющий простейший контейнер
//==============================================================================

#include "triangle.h"

enum {triangle_max_len = 100}; // максимальная длина

//------------------------------------------------------------------------------
// Простейший контейнер на основе одномерного массива
typedef struct TriangleContainer {
  int len; // текущая длина
  struct Triangle *cont[triangle_max_len];
} TriangleContainer;

#endif // __container__