//==============================================================================
// container-constr.c - содержит процедуры
// начальной инициализации и очистки (утилизации) контейнера
//==============================================================================

#include <stdlib.h>
#include <stdio.h>
#include "container.h"

//------------------------------------------------------------------------------
// Статический указатель на контейнер
static Container* c = NULL;

//------------------------------------------------------------------------------
// Инициализация контейнера
void ContainerInit(Container *c) {
  c->len = 0;
}

//------------------------------------------------------------------------------
// Создание контейнера как синглетона
Container* ContainerCreate() {
  if(c == NULL) {
    printf("New container\n");
    c = malloc(sizeof(Container));
    c->len = 0;
  } else {
    printf("The container has already been created\n");
  }
  return c;
}

//------------------------------------------------------------------------------
// Очистка контейнера от элементов (освобождение памяти)
void ContainerClear(Container *c) {
  for(int i = 0; i < c->len; i++) {
    free(c->cont[i]);
  }
  ContainerInit(c);
}

//------------------------------------------------------------------------------
// Удаление контейнера как синглетона
void ContainerDelete() {
  ContainerClear(c);
  free(c);
  c = NULL;
}
