#ifndef __interface__
#define __interface__

//==============================================================================
// interface.h - содержит описания, доступные главной функции - клиенту
//==============================================================================

//------------------------------------------------------------------------------
// Ссылка на структуру, определяющую контейнер
// struct Container;

//------------------------------------------------------------------------------
// Сигнатуры требуемых функций можно тоже подключить через
// заголовочный файл. Но, для простоты, можно и так описать.
// Формирование контейнера - одиночки
struct Container * ContainerCreate();
// Очистка контейнера
void ContainerClear(struct Container* c);
// Удаление контейнера
void ContainerDelete();

// Ввод данных в контейнер
void ContainerIn(struct Container* c, FILE* ifst) ;
// Вывод данных из контейнера
void ContainerOut(struct Container* c, FILE* ofst) ;

#endif // __interface__