//------------------------------------------------------------------------------
// triangle-container-constr.cpp - содержит конструктор
// и процедуру очистки контейнера
//------------------------------------------------------------------------------

#include "triangle-container.h"

//------------------------------------------------------------------------------
// Инициализация контейнера
TriangleContainer::TriangleContainer(): len(0) { }

//------------------------------------------------------------------------------
// Очистка контейнера от элементов (освобождение памяти)
void TriangleContainer::Clear()
{
  for(int i = 0; i < len; i++)
  {
    delete cont[i];
  }
  len = 0;
}
