//
// BrackRecVirth.cpp - рекурсивный распознаватель вложенности круглых скобок.
// Построен на основе диаграмм Вирта, эквивалентных следующей РБНФ
//
// $S = {/ "(" [ S ] ")" /}.
//

#include <iostream>
#include <string>

using namespace std;

string str;	// Строка с входной цепочкой, имитирующая входную ленту
int i;	// Текущее положение входной головки

int erFlag; // Флаг, фиксирующий наличие ошибок в середине правила

// Функция, реализующая чтение символов в буфер из входного потока.
// Используется для ввода с клавиатуры распознаваемой строки.
// Ввод осуществляется до нажатия на клавишу Enter.
// Символ '\n' является концевым маркером входной строки.
void GetOneLine(istream &is, string &str) {
  char ch;
  str = "";
  for(;;) {
    is.get(ch);
    if(is.fail() || ch == '\n') break;
    str += ch;
  }
  str += '\n'; // Добавляется концевой маркер
}

//------------------------------------------------------------------------------
// Класс, описывающий абстрактное состояние автомата
class State {
public:
  // Переопределяемый метод проверки входных символов
  virtual bool CalcState(State**) = 0;
};

//==============================================================================
// Состояния, используемые в S-автомате
//==============================================================================

// Прототип функции автомата, реализующего распознавание нетерминала S.
bool S();
//------------------------------------------------------------------------------
//_0: // Начало S-диаграммы
class S0: public State {
  // Проверка символа для первого состояния
  bool CalcState(State** state) override;
};
//------------------------------------------------------------------------------
// _1: // Точка 1 S-диаграммы
class S1: public State {
  bool CalcState(State** state) override;
};
//------------------------------------------------------------------------------
// _2: // Точка 2 S-диаграммы
class S2: public State {
  bool CalcState(State** state) override;
};
//------------------------------------------------------------------------------
// _3: // Точка 3 S-диаграммы
class S3: public State {
  bool CalcState(State** state) override;
};
//------------------------------------------------------------------------------
// Ложное состояние
class Sfalse: public State {
  bool CalcState(State** state) override {
    cout << "Sfalse: " << str[i] << "\n";
    return false;
  }
};
//------------------------------------------------------------------------------
// Истинное состояние
class Strue: public State {
  bool CalcState(State** state) override {
    return true;
  }
};
//------------------------------------------------------------------------------
// Объекты, определяющие состояния S автомата
S0      s0;
S1      s1;
S2      s2;
S3      s3;
Sfalse  sFalse;
Strue   sTrue;

//------------------------------------------------------------------------------
// После этого можно описать реализации состояний для каждого класса
//------------------------------------------------------------------------------
// Проверка символа для первого состояния
bool S0::CalcState(State** state) {
  if(str[i] == '(') {
    i++;
    *state = &s1;
    return true;
  }
  *state = &sFalse;
  return false; // Первый символ цепочки некорректен
  // что это ошибка, лучше определить снаружи
}
//------------------------------------------------------------------------------
bool S1::CalcState(State** state)  {
  if(str[i] == ')') {
    i++;
    *state = &s3;
    return true;
  }
  if(S()) {
    *state = &s2;
    return true;
  }
  erFlag++;
  cout  << "Position " << i << ", "
        << "Error 1: I want closed bracket or next opened bracket!\n";
  *state = &sFalse;
  return false;
}
//------------------------------------------------------------------------------
bool S2::CalcState(State** state) {
  if(str[i] == ')') {
    i++;
    *state = &s3;
    return true;
  }
  erFlag++;
  cout  << "Position " << i << ", " << "Error 2: I want closed bracket!\n";
  *state = &sFalse;
  return false;
}
//------------------------------------------------------------------------------
bool S3::CalcState(State** state) {
  if(str[i] == '(') {
    i++;
    *state = &s1;
    return true;
  }
  *state = &sTrue;
  return false;
}
//------------------------------------------------------------------------------
// Автомат, реализующий распознавание нетерминала S.
bool S() {
  State* s = &s0;  // начальное состояние S-автомата
  while(s->CalcState(&s));
  return s->CalcState(&s);
}

//==============================================================================
// Состояния, используемые в Z-автомате
//==============================================================================

// Прототип функции автомата, реализующего распознавание нетерминала Z.
bool Z();
//------------------------------------------------------------------------------
//_0: // Начало Z-диаграммы
class Z0: public State {
  bool CalcState(State** state) override;
};
//------------------------------------------------------------------------------
//_1: // Точка 1 Z-диаграммы
class Z1: public State {
  bool CalcState(State** state) override;
};
//------------------------------------------------------------------------------
// Ложное состояние
class Zfalse: public State {
  bool CalcState(State** state) override {
    cout << "Zfalse: " << str[i] << "\n";
    return false;
  }
};
//------------------------------------------------------------------------------
// Истинное состояние
class Ztrue: public State {
  bool CalcState(State** state) override {
    return true;
  }
};
//------------------------------------------------------------------------------
// Объекты, определяющие состояния S автомата
Z0      z0;
Z1      z1;
Zfalse  zFalse;
Ztrue   zTrue;

//------------------------------------------------------------------------------
// После этого можно описать реализации состояний для каждого класса
//------------------------------------------------------------------------------
bool Z0::CalcState(State** state) {
  if(S()) {
    *state = &z1;
    return true;
  }
  *state = &zFalse;
  return false; // Первый символ цепочки некорректен
                // что это ошибка, лучше определить снаружи
}
//------------------------------------------------------------------------------
bool Z1::CalcState(State** state) {
  // За последней скобкой должен быть "конец строки"
  if(str[i] == '\n') {
    *state = &zTrue;
    return false;   // Для выхода из цикла разбора
  }
  erFlag++;
  cout << "Position " << i << ", " << "Error 3: I want end of line!\n";
  *state = &zFalse;
  return false;
}
//------------------------------------------------------------------------------
// Автомат, реализующий распознавание нетерминала Z.
bool Z() {
  State* z = &z0;  // начальное состояние Z-автомата
  while(z->CalcState(&z));
  return z->CalcState(&z);
}

//------------------------------------------------------------------------------
// Функция запускающая разбор и определяющая корректность его завершения,
// если первый символ не принадлежит цепочки
bool Parser() {
  // Начальная инициализация.
  erFlag = 0;
  i = 0;

  // Процесс пошел!
  if(Z())
  {
    return true; // Все прошло нормально
  }
  else {
    if(erFlag)
      cout  << "Position " << i << ", "
        << "Error 4: Internal Error!\n";
    else
      cout  << "Position " << i << ", "
        << "Error 5: Incorrect first symbol of S!\n";
    return false; // Есть ошибки
  }
}

//------------------------------------------------------------------------------
// Главная функция используется для тестирования до тех пор,
// пока не будет прочитана пустая строка
int main () {
  string strCursor;
  str = "";
  // Цикл распознавания различных входных цепочек
  do {
    // Чтение очередной входной цепочки в буфер
    cout << "Input bracket\'s expression!: ";

    // Формируем очередную строку скобок для распознавания.
    GetOneLine(cin, str);
    cout << str;
    // Здесь начинается разбор принятой строки.
    if(Parser())
      cout << "+++++ OK! +++++\n";
    else
      cout << "----- Fatal error (look upper error message)! -----\n";

    // Вывод разобранной строки и значения позиции входой головки.
    cout << "Line: " << str;
    strCursor = " Pos: " + string(i, '-');
    strCursor +='^';
    cout << strCursor << "  i = " << i << "\n\n";

  } while(str != "\n");
  cout << "Goodbye!\n";
  return 0;
}
