//==============================================================================
// is-figure-rectangle.c - Функция явно проверяющая, что фигура является
// прямоугольником. Используется spec_index_cmp
//==============================================================================

#include "figure-rectangle.h"

//------------------------------------------------------------------------------
// Обобщенная функция определяющая, является ли фигура прямоугольником
_Bool isFigureRectangle(Figure * f) {
  struct Figure.rect figRect;
  if(spec_index_cmp(&figRect, f) >= 0) {
    return 1;
  }
  return 0;
}
