#ifndef __figure_circle__
#define __figure_circle__

//==============================================================================
// figure-circle.h - описание специализации фигуры как круга
//==============================================================================

#include "figure.h"
#include "circle.h"

//------------------------------------------------------------------------------
// Фигура - круг
Figure + < circ: Circle; >;

//------------------------------------------------------------------------------
// Перечислимый тип для круга
EnumFig + < circ: void; >;

#endif // __figure_circle__
