//------------------------------------------------------------------------------
// container-in.cpp - содержит процедуру
// ввода фигур в контейнер
//------------------------------------------------------------------------------

#include "container.h"

//------------------------------------------------------------------------------
// Ввод содержимого контейнера
void Container::In(std::ifstream &ifst) {
  while(!ifst.eof()) {
    if((cont[len] = Figure::InAny(ifst)) != 0) {
      len++;
    }
  }
}
