//------------------------------------------------------------------------------
// figure.cpp - содержит реализации всех внутренних методов фигуры
// и инициализацию используемых статических переменных
//------------------------------------------------------------------------------

#include "figure.h"

//------------------------------------------------------------------------------
// Счетчик числа зарегистрированных специализаций
int Figure::specCounter = 0;

//------------------------------------------------------------------------------
// Параметрическая таблица для функций ввода
std::vector<InDataP> InP;
// Параметрическая таблица для функций вывода
std::vector<OutDataP> OutP;

//------------------------------------------------------------------------------
// Метод ввода фигуры через параметрическую таблицу
void Figure::In(std::ifstream &ifst) {
  InP[specTag](this, ifst);
}

//------------------------------------------------------------------------------
// Метод вывода фигуры через параметрическую таблицу
void Figure::Out(std::ofstream &ofst) {
  OutP[specTag](this, ofst);
}
