#ifndef __inout_triangle__
#define __inout_triangle__

//==============================================================================
// inout-triangle.h - описание специализации фигуры как треугольника
//==============================================================================

#include "inout.h"
#include "triangle.h"

//------------------------------------------------------------------------------
// Привязка треугольника через указатель
InOut + < trian: Triangle*; >;

//------------------------------------------------------------------------------
// Подключение треугольника через интерфейс inout

// Ввод треугольника через указатель в псевдоинтерфейсе inout
void In<InOut.trian *x>();

// Вывод треугольника через указатель в псевдоинтерфейсе inout
void Out<InOut.trian *x>();

#endif // __inout_triangle__
