//==============================================================================
// triangle-geometry.c - содержит функции геометрических вычисления параметров
// для уже созданного треугольника
//==============================================================================

#include <stdio.h>
#include <math.h>
#include "triangle.h"

//------------------------------------------------------------------------------
// Вычисление периметра треугольника
double TrianglePerimeter(Triangle *t) {
  return t->a + t->b + t->c;
}

//------------------------------------------------------------------------------
// Вычисление площади треугольника
double TriangleArea(Triangle *r) {
  double p = (r->a + r->b + r->c) / 2.0;
  return sqrt(p * (p - r->a) * (p - r->b) * (p - r->c));
}
