//------------------------------------------------------------------------------
// triangle-out.cpp - содержит процедуру
// вывода параметров треугольника
//------------------------------------------------------------------------------

#include "triangle.h"

//------------------------------------------------------------------------------
// Вывод параметров треугольника
void Triangle::Out(std::ofstream &ofst) {
  ofst << "It is Triangle: a = "
    << a << ", b = " << b
    << ", c = " << c << "\n";
}
