//==============================================================================
// Определения функций обертки над функциями библиотеки pthread
//==============================================================================

#include "ppp-thread.h"

//------------------------------------------------------------------------------
// Обобщенная функция, задающая формат для передачи аргументов
// и подменяемая на соответствующий обработчик специализации.
// Часто он может бытьтолько один
void RunThread <ThreadData* d>() {} //= 0;

//------------------------------------------------------------------------------
// POSIX функция, вызвывающая обработчик обобщения
// подменяемый обработчиком специализации
void* ThreadFunc(void* d) {
  RunThread<(ThreadData*) d>();
  return NULL;
}

//------------------------------------------------------------------------------
// Функция создания и запуска потока
int StartThread(ThreadData* td) {
  return pthread_create(&(td->threadId), NULL, ThreadFunc, td);
}

//------------------------------------------------------------------------------
// Функция ожидания завершения потока
int WaitThread(ThreadData* td) {
  return pthread_join(td->threadId, NULL);
}

