//==============================================================================
// Определения функций, осуществляющих обработку прямоугольника
//==============================================================================

#include <stdio.h>
#include "rectangle-thread.h"

//------------------------------------------------------------------------------
// Вывод результата вычислений периметра конкретно прямоугольника
void PrintRectPerimeter(RectPerimeter* rp, const char* str) {
    printf("Perimeter of %s = %f\n", str, rp->p);
}

//------------------------------------------------------------------------------
// Обработчик специализации, запускаемый в потоке
// вычисляет периметр прямоугольника.
void RunThread<ThreadData.RectPerimeter *rp>() {
  rp->@p = (double)((rp->@r.x+rp->@r.y)*2);
}
