//==============================================================================
// container-constr.c - содержит функции обратотки контейнера
//==============================================================================

#include <stdio.h>
#include <stdlib.h>
#include "container.h"

//------------------------------------------------------------------------------
// Инициализация контейнера
void ContainerInit(Container *c) {
  c->len = 0;
}

//------------------------------------------------------------------------------
// Очистка контейнера от элементов (освобождение памяти)
void ContainerClear(Container *c) {
  for(int i = 0; i < c->len; i++) {
    free(c->cont[i]);
  }
  InitContainer(c);
}

//------------------------------------------------------------------------------
// Сигнатуры требуемых функций можно тоже подключить через
// заголовочный файл. Но, для простоты, можно и так описать.
struct Figure *FigureCreateAndIn(FILE* ifdt);

//------------------------------------------------------------------------------
// Ввод содержимого контейнера из указанного потока
void ContainerIn(Container* c, FILE* ifst, FigureFactory* factory) {
  while(!feof(ifst))  {
    if((c->cont[c->len] = FigureCreateAndIn(ifst, factory)) != 0) {
      c->len++;
    }
  }
}

//------------------------------------------------------------------------------
// Сигнатуры требуемых функций можно тоже подключить через
// заголовочный файл. Но, для простоты, можно и так описать.
void FigureOut<struct Figure* s>(FILE* ofst);

//------------------------------------------------------------------------------
// Вывод содержимого контейнера в указанный поток
void ContainerOut(Container *c, FILE* ofst) {
  fprintf(ofst, "Container contains %d elements.\n", c->len);
  for(int i = 0; i < c->len; i++) {
    fprintf(ofst, "%d: " , i);
    FigureOut<c->cont[i]>(ofst);
  }
}
