//------------------------------------------------------------------------------
// container_Out.cpp - содержит процедуру
// вывода содержимого контейнера
//------------------------------------------------------------------------------

#include <iostream>
#include "container_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Сигнатуры требуемых функций можно тоже подключить через
  // заголовочный файл. Но, для простоты, можно и так описать.
  void Out(shape &s);

//------------------------------------------------------------------------------

  // Вывод содержимого контейнера
  void Out(container &c) {
    cout << "Container contents " << c.len << " elements." << endl;
    for(int i = 0; i < c.len; i++) {
      cout << i << ": ";
      Out(*(c.cont[i]));
    }
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
