//------------------------------------------------------------------------------
// rectangle_Area.cpp - содержит процедуру
// вычисления площади прямоугольника
//------------------------------------------------------------------------------

#include "rectangle_atd.h"

//------------------------------------------------------------------------------

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Вычисление площади прямоугольника
  double Area(rectangle &r)
  {
    return r.x * r.y;
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
