//------------------------------------------------------------------------------
// rectangle_In.cpp - содержит процедуру ввода параметров
// для уже созданного прямоугольника
//------------------------------------------------------------------------------

#include <iostream>
#include "rectangle_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Ввод параметров прямоугольника
  void In(rectangle &r)
  {
    cout << "Input Rectangle: x, y = ";
    cin >> r.x >> r.y;
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
