//------------------------------------------------------------------------------
// shape_Out.cpp - содержит процедуру вывода параметров
// для любой геометрической фигуры
//------------------------------------------------------------------------------

#include <iostream>
#include "shape_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Сигнатуры требуемых функций можно тоже подключить через
  // заголовочный файл. Но, для простоты, можно и так описать.
  void Out(rectangle &r);
  void Out(triangle &t);

//------------------------------------------------------------------------------

  // Вывод параметров текущей фигуры в стандартный поток вывода
  void Out(shape &s)
  {
    switch(s.k) {
    case shape::key::RECTANGLE:
      Out(s.r);
      break;
    case shape::key::TRIANGLE:
      Out(s.t);
      break;
    default:
      cout << "Incorrect figure!" << endl;
    }
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
