#ifndef __triangle_atd__
#define __triangle_atd__

//------------------------------------------------------------------------------
// triangle_atd.h - содержит описание треугольника
//------------------------------------------------------------------------------

namespace simple_shapes {

//------------------------------------------------------------------------------

  // треугольник
  struct triangle {
    int a, b, c; // стороны
  };

//------------------------------------------------------------------------------

} // end simple_shapes namespace

#endif

