//------------------------------------------------------------------------------
// triangle_Constr.cpp - содержит процедуры
// создания, инициализации и удаления треугольника
//------------------------------------------------------------------------------

#include "triangle_atd.h"

//------------------------------------------------------------------------------

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Динамическое создание треугольника по трем сторонам
  triangle *Create_triangle(int a, int b, int c)
  {
    triangle *t = new triangle;
    t->a = a;
    t->b = b;
    t->c = c;
    return t;
  }

//------------------------------------------------------------------------------

  // Инициализация уже созданного треугольника по трем сторонам
  void Init(triangle &t, int a, int b, int c)
  {
    t.a = a;
    t.b = b;
    t.c = c;
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
