//------------------------------------------------------------------------------
// triangle_Out.cpp - содержит процедуру
// вывода параметров треугольника
//------------------------------------------------------------------------------

#include <iostream>
#include "triangle_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Вывод параметров треугольника
  void Out(triangle &t)
  {
    cout << "It is Triangle: a = "
      << t.a << ", b = " << t.b
      << ", c = " << t.c << endl;
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
