//==============================================================================
// figure-out.c - функция, осуществляющая вывод для одной
// альтернативных фигур. Вывод реализован полиморфно.
// Этот обобщенный тип не является частью паттерна Абстрактная фабрика, а
// используется для демонстрации тестовых ввода-вывода при работе
// с общим для всех фигур контейнером.
//==============================================================================

#include <stdio.h>
#include <stdlib.h>
#include "figure.h"

//------------------------------------------------------------------------------
// Прототипы функций вывода семейств фигур
void SimpleFigureOut<SimpleFigure *f>(FILE* ofst);
void CoordFigureOut<CoordFigure *f>(FILE* ofst);

//------------------------------------------------------------------------------
// Обобщенная функция вывода любой фигуры
void FigureOut<Figure *f>(FILE* ofst) {
  printf("FigureOut: Incorrect link to generalized function\n");
  exit(1);
} //= 0;

//------------------------------------------------------------------------------
// Обработчик, осуществляющий вывод простой фигуры
void FigureOut<Figure.simple *f>(FILE* ofst) {
  // printf("Test Simple FigureOut started\n");
  SimpleFigure* pf = f->@;
  SimpleFigureOut<pf>(ofst);
}

//------------------------------------------------------------------------------
// Обработчик, осуществляющий вывод фигуры, заданной координатами
void FigureOut<Figure.coord *f>(FILE* ofst) {
  // printf("Test Coord FigureOut started\n");
  CoordFigure* pf = f->@;
  CoordFigureOut<pf>(ofst);
}
