//==============================================================================
// container-area-out.c - содержит функцию, осуществляющую
// вычислени и тестовый вывод площадей для фигур в контейнере
//==============================================================================

#include <stdio.h>
#include "container.h"

//------------------------------------------------------------------------------
// Сигнатуры требуемых функций можно тоже подключить через
// заголовочный файл. Но, для простоты, можно и так описать.
double FigureArea<Figure* f>();

//------------------------------------------------------------------------------
// Вывод площадей фигур контейнера в указанный поток
void ContainerAreaOut(Container *c, FILE* ofst) {
  fprintf(ofst, "Areas of figures:\n");
  for(int i = 0; i < c->len; i++) {
    fprintf(ofst, "%d: %f\n" , i, FigureArea<c->cont[i]>());
  }
}
