#ifndef __drawing_client__
#define __drawing_client__

//==============================================================================
// drawing-client.h - содержит интерфейс, обеспечивающий клиенту "рисование"
//==============================================================================

#include "container.h"

//------------------------------------------------------------------------------
// Прототип используемый для "рисования", предоставляемый
// соответствующему клиенту
void ContainerOut(Container* c, FILE* ofst);

// Можно переименовать, а при необходимости и скрыть предыдущую функцию,
// если вместо inline инкапсулировать ее реализацию.
static inline void Draw(Container* c, FILE* ofst) {
  ContainerOut(c, ofst);
}

#endif // __drawing_client__