//==============================================================================
// figure-perimeter.c - содержит абстрактную функцию вычисления периметра
// для произвольной геометрической фигуры
//==============================================================================

#include <stdio.h>
#include "figure.h"

//------------------------------------------------------------------------------
// Вычисление периметра для обобщенной фигуры
double FigurePerimeter<Figure *f>() {return 0.0;} //= 0;
