#ifndef __geometry_client__
#define __geometry_client__

//==============================================================================
// geometry-client.h - содержит интерфейс, поддерживающий клиента,
// осуществляющего геометрические вычисления
// В этом клиенте реализация инкапсулирована.
//==============================================================================

#include <stdio.h>
#include "container.h"

//------------------------------------------------------------------------------
// Прототип используемый для вычисления периметров
void CalcPerimeter(Container* c, FILE* ofst);

//------------------------------------------------------------------------------
// Прототип используемый для вычисления площадей
void CalcArea(Container* c, FILE* ofst);

#endif // __geometry_client__