//------------------------------------------------------------------------------
// simple-container-constr.cpp - содержит конструктор
// и процедуру очистки контейнера
//------------------------------------------------------------------------------

#include "simple-container.h"

//------------------------------------------------------------------------------
// Инициализация контейнера
SimpleContainer::SimpleContainer(): len(0) { }

//------------------------------------------------------------------------------
// Очистка контейнера от элементов (освобождение памяти)
void SimpleContainer::Clear()
{
  for(int i = 0; i < len; i++)
  {
    delete cont[i];
  }
  len = 0;
}
