//==============================================================================
// figure-decorator-in.c - Обработчик специализации, осуществляющий
// ввод содержимого фигуры, подключенной к декоратору и декоратора (цвета).
//==============================================================================

#include "figure-decorator.h"
#include <stdio.h>

//------------------------------------------------------------------------------
// Прототип обобщеннай функции ввода фигуры
void FigureIn<Figure * f>(FILE* file);

//------------------------------------------------------------------------------
void DecoratorIn<Decorator * d>(FILE* file) {}

//------------------------------------------------------------------------------
void DecoratorIn<Decorator.Figure * d>(FILE* ifst) {
    FigureIn<&(d->@)>(ifst);
    fscanf(ifst, "%x", &(d->color));
}

//------------------------------------------------------------------------------
// Ввод фигуры совместно с содержимым декоратора
void FigureIn<Figure.Decorator * d>(FILE* ifst)
{
    DecoratorIn<&(d->@)>(ifst);
}

//------------------------------------------------------------------------------
// Ввод фигуры совместно с содержимым декоратора
// void FigureIn<Figure.Decorator * d>(FILE* ifst)
// {
//     // В начале вводятся параметры подключенной фигуры
//     FigureIn<&(d->@.@>(ifst);
//     // Затем вводится содержимое декоратора (цвет)
//     fscanf(ifst, "%x", &(d->@color));
// }
