//------------------------------------------------------------------------------
// container-constr.cpp - содержит конструктор
// и процедуру очистки контейнера
//------------------------------------------------------------------------------

#include "container.h"

//------------------------------------------------------------------------------
// Инициализация контейнера
Container::Container(): len{0} { }

//------------------------------------------------------------------------------
// Очистка контейнера от элементов (освобождение памяти)
void Container::Clear() {
  for(int i = 0; i < len; i++) {
    delete cont[i];
  }
  len = 0;
}
