//------------------------------------------------------------------------------
// circle-out.cpp - содержит процедуру
// вывода параметров круга
//------------------------------------------------------------------------------

#include "circle.h"

//------------------------------------------------------------------------------
// Вывод параметров круга в файл
void Circle::Out(std::ofstream &ofst) {
  ofst << "It is Circle: r = " << r << "\n";
}

//------------------------------------------------------------------------------
// Вывод параметров круга в cout
void Circle::Out() {
  std::cout << "It is Circle: r = " << r << "\n";
}
