//==============================================================================
// figure-circle-in.c - Обработчики специализации, осуществляющий
// ввод круга как фигуры.
// Подставляется вместо абстрактной обобщающей функции
//==============================================================================

#include <stdio.h>
#include "figure-circle.h"

//------------------------------------------------------------------------------
// Прототип функции ввода круга
void CircleIn(Circle *c, FILE* ifst);
// Прототип обобщеннай функции вывода фигуры
void FigureIn<Figure *f>(FILE* ifst);

//------------------------------------------------------------------------------
// Ввод прямоугольника как фигуры
void FigureIn<struct Figure.Circle *f>(FILE* ifst) {
  Circle* c = &(f->@);
  CircleIn(c, ifst);
}
