#ifndef __pplist__
#define __pplist__

//==============================================================================
// pplist.h
// Заголовочный файл, обеспечивающий полный интерфейс к возможностям
// процедурно-параметрического списка.
// Собирает воединое все заголовочные файлы, разделенные по назначению
//==============================================================================

#include <stdint.h>
#include <stdio.h>

#include "pplist/data.h"
#include "pplist/interface.h"
#include "pplist/general.h"
#include "pplist/macro.h"

#endif // __pplist__
