#ifndef __command__
#define __command__

//==============================================================================
// command.h - Описание команд и прототипов обобщенных функций,
// связанных с их использованием.
//==============================================================================

//------------------------------------------------------------------------------
// Различные команды задаются расширяемыми перечислениями
// вместо использования классов
typedef struct Command {} <> Command;
Command + <NewRect: void;>;   // Создать и заполнить прямоугольник
Command + <NewTrian: void;>;  // Создать и заполнить треугольник
Command + <OutFig: void;>;    // Вывод текущей фигуры
Command + <OutCont: void;>;   // Вывод содержимого контейнера
Command + <Finish: void;>;    // Конечное состояние

//------------------------------------------------------------------------------
// Контекст автомата, обеспечивающий связь всех обрабатываемых данных
struct Context;

//------------------------------------------------------------------------------
// Обобщенная функция обработки состояния
void Execute<Command* command>(struct Context* context);

#endif // __command__

