//------------------------------------------------------------------------------
// triangle_In.cpp - содержит процедуру ввода параметров
// для уже созданного треугольника
//------------------------------------------------------------------------------

#include <iostream>
#include "triangle.h"

//------------------------------------------------------------------------------
// Ввод параметров треугольника
void SimpleTriangle::InData(std::ifstream &ifst) {
  ifst >> a >> b >> c;
  // std::cout << "    " << a << ", " << b <<  ", " << c << "\n";
}
