//------------------------------------------------------------------------------
// container.cpp - реализации методов контейнера, собранные воедино
//------------------------------------------------------------------------------

#include "container.h"

//------------------------------------------------------------------------------
// Инициализация контейнера
Container::Container(): len{0} { }

//------------------------------------------------------------------------------
// Очистка контейнера от элементов (освобождение памяти)
void Container::Clear() {
  for(int i = 0; i < len; i++) {
    delete cont[i];
  }
  len = 0;
}

//------------------------------------------------------------------------------
// Ввод содержимого контейнера
void Container::In(std::ifstream &ifst) {
  while(!ifst.eof()) {
    if((cont[len] = Figure::In(ifst)) != 0) {
      len++;
    }
  }
}
