//------------------------------------------------------------------------------
// figure-in.cpp - содержит процедуру ввода параметров
// для уже созданной любой фигуры
//------------------------------------------------------------------------------

#include "figure.h"

//------------------------------------------------------------------------------
// Необходима подключить информацию обо всех имеющихся
// геометрических фигурах
#include "rectangle.h"
#include "triangle.h"

//------------------------------------------------------------------------------
// Ввод параметров обобщенной фигуры из стандартного потока ввода
Figure* Figure::In(std::ifstream &ifst) {
  Figure *sp;
  int k;
  ifst >> k;
  switch(k) {
    case 1:
      sp = new Rectangle;
      break;
    case 2:
      sp = new Triangle;
      break;
    default:
      return 0;
  }
  sp->InData(ifst);
  return sp;
}
