#ifndef __triangle__
#define __triangle__

//------------------------------------------------------------------------------
// triangle.h - содержит описание класса треугольника,
// порожденного от базового класса Figure
//------------------------------------------------------------------------------

// Требуется описание класса Figure
#include "figure.h"

//------------------------------------------------------------------------------
// треугольник
class Triangle: public Figure {
  friend class ClientDraw;
  friend class ClientGeometry;
  int a, b, c; // стороны
public:
  // переопределяем интерфейс класса
  virtual void InData(std::ifstream &ifst);  // ввод данных из потока
  Triangle(): a{0}, b{0}, c{0} {} // создание без инициализации.
};

#endif // __triangle__

