//==============================================================================
// figure-triangle-perimeter.c - Обработчик специализации, осуществляющий
// вычисление периметра треугольника как фигуры.
// Подставляется вместо абстрактной обобщающей функции
//==============================================================================

#include "figure-triangle.h"

//------------------------------------------------------------------------------
// Прототип функции вычисления периметра треугольника
double TrianglePerimeter(Triangle *t);
// Прототип обобщенной функции вычисления периметра
double FigurePerimeter<Figure *f>();

//------------------------------------------------------------------------------
// Периметр прямоугольника как фигуры
double FigurePerimeter<Figure.trian *f>() {
  return TrianglePerimeter(&(f->@));
  // return (double)(f->@a + f->@b + f->@c);
}
