#ifndef __word32_spec__
#define __word32_spec__

//==============================================================================
// word32-spec.h - содержит объявлениия специализаций от 32-разрядного слова,
//==============================================================================

#include "word32.h"

//------------------------------------------------------------------------------
// Специализация 32-слова как 32-разрядного целого со знаком
w32 + <i32:word32;>;
// Специализация 32-слова как 32-разрядного беззнакового целого
w32 + <u32:word32;>;

//==============================================================================
// Обработчики специализаций для обработки 32-разрядных слов
//==============================================================================

//------------------------------------------------------------------------------
// Сложение 32-разрядных знаковых целых чисел
void Add<w32.i32 *src1, w32.i32 *src2>(w32 *dst);

//------------------------------------------------------------------------------
// Сложение 32-разрядных беззнаковых целых чисел
void Add<w32.u32 *src1, w32.u32 *src2>(w32 *dst);

#endif // __word32_spec__