//==============================================================================
// word32-spec.c - содержит определения обработчиков
// специализаций, сформированных от 32-разрядного слова,
//==============================================================================

#include "word32-spec.h"

//==============================================================================
// Обработчики специализаций для обработки 32-разрядных слов
//==============================================================================

// Обобщение, определяющее сложение 32-х разрядных машинных слов
void Add<w32* src1, w32* src2>(w32* dst) {
  printf("Incorrect implementation of specialized Add function!\n");
}

//------------------------------------------------------------------------------
// Сложение 32-разрядных знаковых целых чисел
void Add<w32.i32 *src1, w32.i32 *src2>(w32 *dst) {
  int opd1 = (int)(src1->@val32);
  int opd2 = (int)(src2->@val32);
  struct w32.i32 *result = (struct w32.i32*)dst;
  result->@val32 = opd1 + opd2;
  // ((struct w32<i32>*)dst)->@val32 = opd1 + opd2;
}

//------------------------------------------------------------------------------
// Сложение 32-разрядных беззнаковых целых чисел
void Add<w32.u32 *src1, w32.u32 *src2>(w32 *dst) {
  unsigned int opd1 = (unsigned int)(src1->@val32);
  unsigned int opd2 = (unsigned int)(src2->@val32);
  struct w32.u32 *result = (struct w32.u32>*)dst;
  result->@val32 = opd1 + opd2;
  // ((struct w32<u32>*)dst)->@val32 = opd1 + opd2;
}
