#ifndef __triangle_factory__
#define __triangle_factory__

//------------------------------------------------------------------------------
// triangle-factory.h - содержит описание фабрики, создаюющей треугольники
//------------------------------------------------------------------------------

#include  "triangle.h"
#include  "figure-factory.h"

//------------------------------------------------------------------------------
// Класс фабрики, порождающей треугольники
class TriangleFactory: public FigureFactory {
  int key; // Ключ фабрики, совпадающий с ключом в файле
public:
  // иденитификация, порождение и ввод фигуры из потока
  virtual Figure* Test(int k);
  // Конструктор, регистрирующий ключ = 2 для треугольников
  TriangleFactory();
};

#endif // __triangle_factory__