//------------------------------------------------------------------------------
// figure.cpp - содержит реализации всех внутренних методов фигуры
// и инициализацию используемых статических переменных
//------------------------------------------------------------------------------

#include "figure.h"

//------------------------------------------------------------------------------
// Счетчик числа зарегистрированных специализаций для интерфейса фигур
int specCounter = 0;

//------------------------------------------------------------------------------
// Параметрическая таблица для функций ввода
std::vector<InDataP> InP;
// Параметрическая таблица для функций вывода
std::vector<OutDataP> OutP;

//------------------------------------------------------------------------------
// Конструктор, так как интефейс формируется и инициализируется
Figure::Figure() {}

//------------------------------------------------------------------------------
// Метод ввода фигуры через параметрическую таблицу
void Figure::InFP(std::ifstream &ifst) {
  InP[specObject->specTag](this->specObject, ifst);
}

//------------------------------------------------------------------------------
// Метод вывода фигуры через параметрическую таблицу
void Figure::OutFP(std::ofstream &ofst) {
  OutP[specObject->specTag](this->specObject, ofst);
}
