#ifndef __figure__
#define __figure__

//==============================================================================
// figure.h - содержит описание обобщающей геометрической фигуры,
//==============================================================================

#include "rectangle.h"
#include "triangle.h"

//------------------------------------------------------------------------------
// значения ключей для каждой из фигур
typedef enum key {SIMPLE_RECTANGLE, SIMPLE_TRIANGLE} key;

//------------------------------------------------------------------------------
// структура, обобщающая все имеющиеся фигуры
typedef struct SimpleFigure {
  key k; // ключ
  // используемые альтернативы
  union { // используем простейшую реализацию
    SimpleRectangle r;
    SimpleTriangle t;
  };
} SimpleFigure;

#endif // __figure__