//==============================================================================
// rectangle-out.c - содержит процедуру
// вывода параметров прямоугольника
//==============================================================================

#include <stdio.h>
#include "rectangle.h"

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника в форматируемый поток
void RectangleOut(SimpleRectangle *r, FILE* ofst) {
  fprintf(ofst,
          "It is Simple Rectangle: x = %.3lf, y = %.3lf\n",
          r->x, r->y);
}
