//==============================================================================
// triangle-out.c - содержит процедуру
// вывода параметров треугольника
//==============================================================================

#include <stdio.h>
#include "triangle.h"

//------------------------------------------------------------------------------
// Вывод параметров треугольника в поток
void TriangleOut(SimpleTriangle *t, FILE *ofst) {
  fprintf(ofst,
          "It is Simple Triangle: a = %.3lf, b = %.3lf, c = %.3lf\n",
          t->a, t->b, t->c);
}

