#ifndef __objects__
#define __objects__

#include <stdio.h>
#include "constants.h"

//==============================================================================
// objects.h - описание различных объектов, используемых в примере.
// Можно добавлять по ходу в разных файлов, если нужна эволюция.
//==============================================================================

//------------------------------------------------------------------------------
// прямоугольник
typedef struct Rectangle {
  int x, y; // ширина, высота
} Rectangle;
O+<Rectangle;>;

//------------------------------------------------------------------------------
// треугольник
typedef struct Triangle {
  int a, b, c; // стороны треугольника
} Triangle;
O+<Triangle;>;

//------------------------------------------------------------------------------
// Простейший контейнер на основе одномерного массива
typedef struct Container {
  int len; // текущая длина
  struct O* cont[max_len];
} Container;
O+<Container;>;

//------------------------------------------------------------------------------
// Целочисленный объект
O+<int;>;

#endif // __objects__
