//==============================================================================
// parent.c - реализация обобщенных функций обобщенного родительского объекта,
// переопределяемых для конкретных объектов.
// Реализована как абстракная функция.
//==============================================================================

#include <stdlib.h>
#include "parent.h"

//------------------------------------------------------------------------------
// Обобщенная функция ввода данных из входного потока
void Input<O* o>(FILE* f) {
  fprintf(f, "The object do not have Input message\n");
  exit(11);
}

