//==============================================================================
// container-in.c - содержит процедуру
// ввода фигур в контейнер из потока
//==============================================================================

#include <stdio.h>
#include "container.h"

//------------------------------------------------------------------------------
// Сигнатуры требуемых функций можно тоже подключить через
// заголовочный файл. Но, для простоты, можно и так описать.
struct Figure *FigureCreateAndIn(FILE* ifdt);
// Прототип обобщенной функции ввода фигуры из прокси
void ProxyFigureIn<Figure *f>();

//------------------------------------------------------------------------------
// Ввод содержимого контейнера из указанного потока
void ContainerIn(Container* c, FILE* ifst) {
  while(!feof(ifst))  {
    if((c->cont[c->len] = FigureCreateAndIn(ifst)) != 0) {
      c->len++;
    }
  }
}

//------------------------------------------------------------------------------
// Ввод в прокси фигуры, расположенные в контейнере, фигур, указанных в прокси
void ProxyContainerIn(Container *c) {
  // fprintf(ofst, "Container contains %d elements.\n", c->len);
  for(int i = 0; i < c->len; i++) {
    ProxyFigureIn<c->cont[i]>();
  }
}
