#ifndef __figure_container__
#define __figure_container__

//==============================================================================
// figure-container.h - описание специализации фигуры как контейнера
//==============================================================================

#include "figure.h"
#include "container.h"

//------------------------------------------------------------------------------
// Фигура - прямоугольник
Figure + < cont: Container; >;

#endif // __figure_container__
