#ifndef __geometry_rectangle__
#define __geometry_rectangle__

//==============================================================================
// geometry-rectangle.h - связываение интерфейса с прямоугольником
//==============================================================================

#include "geometry.h"
#include "rectangle.h"

//------------------------------------------------------------------------------
// Подключение прямоугольника через интерфейс geometry

// Вычисление периметра прямоугольника через указатель в интерфейсе
double Perimeter<Figure.rect *x>();

// Вычисление площади прямоугольника через указатель в псевдоинтерфейсе geometry
double Area<Figure.rect *x>();

#endif // __geometry_rectangle__
