#ifndef __geometry__
#define __geometry__

//==============================================================================
// geometry.h - содержит описание структуры псевдоинтерфейса вычисления
// параметров геометрических фигур
//==============================================================================

#include "figure.h"

//------------------------------------------------------------------------------
// Привязка прямоугольника через указатель
Figure + < rect: Rectangle*; >;

//------------------------------------------------------------------------------
// Описание функций интерфейса

// Обобщающая функция для вычисления периметра через интерфейс geometry
double Perimeter<Figure *x>();

// Обобщающая функция для вычисления площади через интерфейс geometry
double Area<Figure *x>();

#endif // __geometry__