//==============================================================================
// geometry-triangle.c - Обработчик треугольника,
// подключенного через псевдоинтерфейс geometry
//==============================================================================

#include <stdio.h>
#include "geometry-triangle.h"

//------------------------------------------------------------------------------
// Периметр треугольника через указатель в псевдоинтерфейсе geometry
double Perimeter<Figure.trian *x>() {
  return TrianglePerimeter(x->@);
}

//------------------------------------------------------------------------------
// Площадь треугольника через указатель в псевдоинтерфейсе geometry
double Area<Figure.trian *x>() {
  return TriangleArea(x->@);
}
