#ifndef __geometry_triangle__
#define __geometry_triangle__

//==============================================================================
// geometry-triangle.h - связываение интерфейса с треугольником
//==============================================================================

#include "geometry.h"
#include "triangle.h"

//------------------------------------------------------------------------------
// Привязка треугольника через указатель
Figure + < trian: Triangle*; >;

//------------------------------------------------------------------------------
// Подключение треугольника через интерфейс geometry

// Вычисление периметра треугольника через указатель в интерфейсе
double Perimeter<Figure.trian *x>();

// Вычисление площади треугольника через указатель в псевдоинтерфейсе geometry
double Area<Figure.trian *x>();

#endif // __geometry_triangle__
