//==============================================================================
// geometry-rectangle-in.c - Обработчик прямоугольника,
// подключенного через псевдоинтерфейс geometry
//==============================================================================

#include <stdio.h>
#include "geometry-rectangle.h"

//------------------------------------------------------------------------------
// Периметр прямоугольника через указатель в псевдоинтерфейсе geometry
double Perimeter<Figure.rect *x>() {
  return RectanglePerimeter(x->@);
}

//------------------------------------------------------------------------------
// Площадь прямоугольника через указатель в псевдоинтерфейсе geometry
double Area<Figure.rect *x>() {
  return RectangleArea(x->@);
}
