#ifndef __inout_rectangle__
#define __inout_rectangle__

//==============================================================================
// inout-rectangle.h - связываение интерфейса с прямоугольником
//==============================================================================

#include "inout.h"
#include "rectangle.h"

//------------------------------------------------------------------------------
// Привязка прямоугольника через указатель
Figure + < rect: Rectangle*; >;

//------------------------------------------------------------------------------
// Подключение прямоугольника через интерфейс InOut

// Ввод прямоугольника через указатель в интерфейсе
void In<Figure.rect *x>();

// Вывод прямоугольника через указатель в псевдоинтерфейсе
void Out<Figure.rect *x>();

#endif // __inout_rectangle__
