//==============================================================================
// inout-triangle-in.c - Обработчик треугольника
// подключенного через псевдоинтерфейс inout
//==============================================================================

#include <stdio.h>
#include "inout-triangle.h"

//------------------------------------------------------------------------------
// Ввод треугольника через указатель в псевдоинтерфейсе inout
void In<Figure.trian *x>() {
  TriangleIn(x->@);
}

//------------------------------------------------------------------------------
// Вывод треугольника через указатель в псевдоинтерфейсе inout
void Out<Figure.trian *x>() {
  TriangleOut(x->@);
}
