//==============================================================================
// figure-decorator-out.c - Обработчик специализации, осуществляющий
// вывод содержимого фигуры, подключенной к декоратору и декоратора (цвета).
//==============================================================================

#include <stdio.h>
#include "figure-color.h"

//------------------------------------------------------------------------------
// Прототип функции вывода прямоугольника
void RectangleOut(Rectangle *r, FILE* ofst);
// Прототип функции вывода треугольника
void TriangleOut(Triangle *t, FILE* ofst);

//------------------------------------------------------------------------------
// Обобщенная функция вывода фигуры с цветом
void ColoredOut<Color* f>(FILE* ofst) {}
// Обработчик специализации, осуществлющий вывод прямоугольника с цветом
void ColoredOut<Color.rect* f>(FILE* ofst) {
    RectangleOut(&(f->@), ofst);
}
// Обработчик специализации, осуществлющий вывод треугольника с цветом
void ColoredOut<Color.trian* f>(FILE* ofst) {
    TriangleOut(&(f->@), ofst);
}

//------------------------------------------------------------------------------
// Ввод фигуры совместно с содержимым декоратора
void FigureOut<Figure.color * d>(FILE* ofst) {
    // В начале выводится содержимое фигуры
    struct Color* dfp = (struct Color*)&d->@;
    ColoredOut<dfp>(ofst);
    // Затем содержимое декоратора
    fprintf(ofst, "    Color is %#0.6X\n", d->@color);
}
