//==============================================================================
// rectangle_out.rs - содержит метод вывода прямоугольника
//==============================================================================
pub mod rectangle;
pub use rectangle::Rectangle;

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника в форматируемый поток
pub fn out(r: &rectangle::Rectangle) {
  println!("It is Rectangle: x = {}, y = {}", r.x, r.y);
}

