//==============================================================================
// container-out.c - содержит процедуру
// вывода содержимого контейнера
//==============================================================================

#include <stdio.h>
#include "container.h"

//------------------------------------------------------------------------------
// Сигнатуры требуемых функций можно тоже подключить через
// заголовочный файл. Но, для простоты, можно и так описать.
void FigureOut<struct Figure* s>(FILE* ofst);

//------------------------------------------------------------------------------
// Обработчик специализации, обеспечивающий вывод фигуры через указатель на нее
void ppVector_element_print<ppVector.fig* v>(FILE* f) {
  FigureOut<v->@>(f);
}

//------------------------------------------------------------------------------
// Вывод содержимого контейнера в указанный поток
void  ContainerOut(struct ppVector.fig* c, FILE* ofst) {
  unsigned  len = ppVector_size((ppVector*)c);
  fprintf(ofst, "Container contains %u elements.\n", len);
  ppVector_print(ofst, (ppVector*)c);
}
