#ifndef __figure_triangle__
#define __figure_triangle__

//==============================================================================
// figure-triangle.h - описание специализации фигуры как треугольника
//==============================================================================

#include "figure.h"
#include "triangle.h"

//------------------------------------------------------------------------------
// Фигура - треугольник
Figure + < trian: Triangle; >;

//------------------------------------------------------------------------------
// Ввод треугольника из файла
Input + <trian: void;>;

#endif // __figure_triangle__
