//------------------------------------------------------------------------------
// figure-input.cpp - содержит статический метод
// ввода параметров заданной фигуры
//------------------------------------------------------------------------------

#include <iostream>
#include "figure.h"

//------------------------------------------------------------------------------
// Необходима подключить информацию обо всех имеющихся
// геометрических фигурах
#include "rectangle.h"
#include "triangle.h"

//------------------------------------------------------------------------------
// Ввод параметров обобщенной фигуры из стандартного потока ввода
Figure* Figure::Create() {
  Figure *sp;
  int k = 0;
  std::cout << "Input figure type (1 - rectangle, 2 - triangle): ";
  std::cin >> k;
  switch(k) {
    case 1:
      sp = new Rectangle;
      break;
    case 2:
      sp = new Triangle;
      break;
    default:
      return 0;
  }
  sp->In();
  return sp;
}
