//------------------------------------------------------------------------------
// rectangle.cpp - содержит методы прямоугольника
//------------------------------------------------------------------------------

#include <iostream>
#include "rectangle.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника
void Rectangle::In() {
  Figure::In();
  std::cout << "Input Rectangle: x = ";
  std::cin >> x;
  std::cout << "y = ";
  std::cin >> y;
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника
void Rectangle::Out() {
  Figure::Out();
  std::cout << "It is Rectangle: x = " << x << ", y = " << y << "\n";
}
