//------------------------------------------------------------------------------
// triangle.cpp - содержит методы треугольника
//------------------------------------------------------------------------------

#include <iostream>
#include "triangle.h"

//------------------------------------------------------------------------------
// Ввод параметров треугольника
void Triangle::In() {
  Figure::In();
  std::cout << "Input Triangle: a = ";
  std::cin >> a;
  std::cout << "b = ";
  std::cin >> b;
  std::cout << "c = ";
  std::cin >> c;
}

//------------------------------------------------------------------------------
// Вывод параметров треугольника
void Triangle::Out() {
  Figure::Out();
  std::cout << "It is Triangle: a = "
       << a << ", b = " << b
       << ", c = " << c << "\n";
}
