//------------------------------------------------------------------------------
// rectangle_Out.cpp - содержит процедуру 
// вывода параметров прямоугольника
//------------------------------------------------------------------------------

#include "rectangle_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Вывод параметров прямоугольника
  void rectangle::Out(ofstream &ofst) {
    ofst << "It is Rectangle: x = " << x << ", y = " << y << endl;
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
