//------------------------------------------------------------------------------
// triangle_In.cpp - содержит процедуру ввода параметров 
// дл€ уже созданного треугольника
//------------------------------------------------------------------------------

#include "triangle_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // ¬вод параметров треугольника
  void triangle::InData(ifstream &ifst) {
    ifst >> a >> b >> c;
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
