#ifndef __figure_rectangle__
#define __figure_rectangle__

//==============================================================================
// figure-rectangle.h - Описание специализации прямоугольника-фигуры
//==============================================================================

#include "figure.h"
#include "rectangle.h"

//------------------------------------------------------------------------------
// Прямая привязка прямоугольника
Figure + < rect: Rectangle; >;

//------------------------------------------------------------------------------
// Подключение прямоугольника как Figure

// Ввод прямоугольника-фигуры
void In<Figure.rect *x>();

// Вывод прямоугольника-фигуры
void Out<Figure.rect *x>();

#endif // __figure_rectangle__
