//------------------------------------------------------------------------------
// container_In.cpp - содержит процедуру 
// ввода фигур в контейнер из потока
//------------------------------------------------------------------------------

#include <fstream>
#include "container_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Сигнатуры требуемых функций можно тоже подключить через
  // заголовочный файл. Но, для простоты, можно и так описать.
  shape *In(ifstream &ifdt);

//------------------------------------------------------------------------------
  // Ввод содержимого контейнера из указанного потока
  void In(container &c, ifstream &ifst) {
    while(!ifst.eof())
    {
      if((c.cont[c.len] = In(ifst)) != 0)
      {
        c.len++;
      }
    }
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
