//------------------------------------------------------------------------------
// container_Out.cpp - содержит процедуру 
// вывода содержимого контейнера
//------------------------------------------------------------------------------

#include <fstream>
#include "container_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Сигнатуры требуемых функций можно тоже подключить через
  // заголовочный файл. Но, для простоты, можно и так описать.
  void Out(shape &s, ofstream &ofst);

//------------------------------------------------------------------------------

  // Вывод содержимого контейнера в указанный поток
  void Out(container &c, ofstream &ofst) {
    ofst << "Container contains " << c.len << " elements." << endl;
    for(int i = 0; i < c.len; i++) {
      ofst << i << ": ";
      Out(*(c.cont[i]), ofst);
    }
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
