#ifndef __container_atd__
#define __container_atd__

//------------------------------------------------------------------------------
// container.h - содержит тип данных,
// представляющий простейший контейнер
//------------------------------------------------------------------------------

namespace simple_shapes {

//------------------------------------------------------------------------------
// Ссылка на описание геометрической фигуры. Знание структуры самой фигуры 
// для представленной реализации контейнера не требуется
//------------------------------------------------------------------------------
struct shape;

//------------------------------------------------------------------------------
// Простейший контейнер на основе одномерного массива
//------------------------------------------------------------------------------

  struct container
  {
    enum {max_len = 100}; // максимальная длина
    int len; // текущая длина
    shape *cont[max_len];
  };

//------------------------------------------------------------------------------

} // end simple_shapes namespace

#endif