#ifndef __rectangle_atd__
#define __rectangle_atd__

//------------------------------------------------------------------------------
// rectangle_atd.h - содержит описание прямоугольника
//------------------------------------------------------------------------------

namespace simple_shapes {

//------------------------------------------------------------------------------

  // прямоугольник
  struct rectangle {
    int x, y; // ширина, высота
  };

//------------------------------------------------------------------------------

} // end simple_shapes namespace

#endif