//------------------------------------------------------------------------------
// rectangle_In.cpp - содержит процедуру ввода параметров 
// для уже созданного прямоугольника
//------------------------------------------------------------------------------

#include <fstream>
#include "rectangle_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Ввод параметров прямоугольника из файла
  void In(rectangle &r, ifstream &ifst) 
  {
    ifst >> r.x >> r.y;
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
