//------------------------------------------------------------------------------
// rectangle_Out.cpp - содержит процедуру 
// вывода параметров прямоугольника
//------------------------------------------------------------------------------

#include <fstream>
#include "rectangle_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Вывод параметров прямоугольника в форматируемый поток
  void Out(rectangle &r, ofstream &ofst) 
  {
    ofst << "It is Rectangle: x = " << r.x << ", y = " << r.y << endl;
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
