//------------------------------------------------------------------------------
// shape_In.cpp - содержит процедуру ввода параметров 
// и создания произвольной фигуры
//------------------------------------------------------------------------------

#include <fstream>
#include "shape_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Сигнатуры требуемых функций можно тоже подключить через
  // заголовочный файл. Но, для простоты, можно и так описать.
  void In(rectangle &r, ifstream &ist);
  void In(triangle  &t, ifstream &ist);

//------------------------------------------------------------------------------

  // Ввод параметров обобщенной фигуры из файла
  shape* In(ifstream &ifst)
  {
    shape *sp;
    int k;
    ifst >> k;
    switch(k) {
    case 1:
      sp = new shape;
      sp->k = shape::RECTANGLE;
      // sp->k = sp->RECTANGLE;
      In(sp->r, ifst);
      return sp;
    case 2:
      sp = new shape;
      sp->k = shape::TRIANGLE;
      // sp->k = sp->TRIANGLE;
      In(sp->t, ifst);
      return sp;
    default:
      return 0;
    }
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
