#ifndef __shape_atd__
#define __shape_atd__

//------------------------------------------------------------------------------
// shape.h - содержит описание обобщающей геометрической фигуры,
//------------------------------------------------------------------------------

#include "rectangle_atd.h"
#include "triangle_atd.h"

//------------------------------------------------------------------------------

namespace simple_shapes {

  // структура, обобщающая все имеющиеся фигуры
  struct shape {
    // значения ключей для каждой из фигур
    enum key {RECTANGLE, TRIANGLE};
    key k; // ключ
    // используемые альтернативы
    union { // используем простейшую реализацию
      rectangle r;
      triangle t;
    };
  };

//------------------------------------------------------------------------------

} // end simple_shapes namespace

#endif