//------------------------------------------------------------------------------
// triangle_Out.cpp - содержит процедуру 
// вывода параметров треугольника
//------------------------------------------------------------------------------

#include <fstream>
#include "triangle_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Вывод параметров треугольника в поток
  void Out(triangle &t, ofstream &ofst)
  {
    ofst << "It is Triangle: a = " 
      << t.a << ", b = " << t.b
      << ", c = " << t.c << endl;
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
