//------------------------------------------------------------------------------
// triangle_In.cpp - содержит процедуру ввода параметров 
// для уже созданного треугольника
//------------------------------------------------------------------------------

#include <fstream>
#include "triangle_atd.h"

//------------------------------------------------------------------------------

using namespace std;

namespace simple_shapes {

//------------------------------------------------------------------------------

  // Ввод параметров треугольника из потока
  void In(triangle &t, ifstream &ifst) 
  {
    ifst >> t.a >> t.b >> t.c;
  }

//------------------------------------------------------------------------------

} // end simple_shapes namespace
