//==============================================================================
// container-in.c - содержит процедуру
// ввода фигур в контейнер из потока
//==============================================================================

#include <stdio.h>
#include "container.h"

//------------------------------------------------------------------------------
// Сигнатуры требуемых функций можно тоже подключить через
// заголовочный файл. Но, для простоты, можно и так описать.
struct Figure *FigureCreateAndIn(FILE* ifdt);

// Временный прототип для тестового вывода фигуры
void FigureOut<struct Figure* s>(FILE* ofst);

//------------------------------------------------------------------------------
// Ввод содержимого контейнера из указанного потока
void  ContainerIn(struct ppVector.fig* c, FILE* ifst) {
  while(!feof(ifst))  {
    struct Figure* figure;
    if((figure = FigureCreateAndIn(ifst)) != 0) {
      // c->@ = figure; ppVector_push_back((ppVector*)c);
      ppVector_PUSH_BACK((*c), figure)
    }
  }
}
